{"body":"as a fan of a team that traded a 1st round pick for deion branch................brady is fucking amazing","score":"32","subreddit":"nfl"}
{"body":"since you are cherry picking i guess i will too... the large majority have been in denver. manning broncos were 0-3 in foxboro. we have a better winning record in mile high in the brady era than you do in foxboro. you just have lucked out by being in mile high more. if you want to talk abotu bad olines as an excuse... why dont we talk about the 2015 afccg in denver? brady was hit a historic amount that day.  ","score":"36","subreddit":"nfl"}
{"body":"http://a.video.nfl.com/films/s2012/nflcom/w20/130120_phl_wk20_ne_brady_slide_kick_3200k.mp4","score":"170","subreddit":"nfl"}
{"body":"Saying that dude is a snake oil salesman would be far to kind, in the past he has made products claiming they cure [aids and cancer](http://www.bostonmagazine.com/news/blog/2015/10/09/tom-brady-alex-guerrero-neurosafe/).","score":"12","subreddit":"nfl"}
{"body":"Moss had his (edit: second)-highest yards and most receiving TDs in 2008 with brady, so you could say he had his best year there too.","score":"65","subreddit":"nfl"}
{"body":"mt Monadnock isn't really part of the appalachians.  it's a monadnock after all.\n\ntom brady confirm to never rest ","score":"25","subreddit":"nfl"}
{"body":"jimmy g aint getting no supermodel wife that makes more than him so brady","score":"17","subreddit":"nfl"}
{"body":"imagine if brady kept telling Butler to go wash his truck and not to scratch it all season long. ","score":"45","subreddit":"nfl"}
{"body":"[(autistic screeching)] (http://i.usatoday.net/communitymanager/_photos/game-on/2012/05/29/bradyx-large.jpg)","score":"48","subreddit":"nfl"}
{"body":"NFL.com video: WK 17 Can't-Miss Play: Tom Brady punts [HD](http://a.video.nfl.com/films/s2013/nflcom/w17/131229_phl_wk17_bp_ne_brady_punt_3200k.mp4) [SD](http://a.video.nfl.com/films/s2013/nflcom/w17/131229_phl_wk17_bp_ne_brady_punt_500k.mp4)\n\n","score":"18","subreddit":"nfl"}
{"body":"Heh I wouldn't take any other QB for Hail Mary's tho, luck plays into it but even brady isn't that good with his deep bomb (ask anyone in this sub)\n\nI don't trust anyone else with Hail Rodgers other than Rodgers himself. 4 successful attempts in 1 year is pretty good and not just lucky ","score":"16","subreddit":"nfl"}
{"body":"idk why both of yall are getting downvoted, we have historically seen every excuse imaginable against brady:\n\n-two losses, \n-him leading them to FGs instead of TDs (who tf cares, you only needed a FG to win, why risk the victory)\n-having a defense (didn't look like a defense in SB 38, 46)\n-barely winning super bowls (more competitive super bowls means harder victories and more impressive victories)","score":"20","subreddit":"nfl"}
{"body":"julio is setting himself up for a 2007 brady SB media week curse. \n\n\"no one can cover me 1 v 1\"\n\"im not limited anymore\"\n\n....\n\n\"you only think we will score 21 points?\"","score":"12","subreddit":"nfl"}
{"body":"of course brady would still be mad, sherman is still undefeated against brady ^^^^in ^^^^the ^^^^regular ^^^^season","score":"13","subreddit":"nfl"}
{"body":"Simply put, no matter who you think the goat is, Manning was more valuable to the Colts than brady was to the pats. \n\nAlthough the whole cassel went 11-5 thing is a bit overblown. The easiest divisional rotation in the league (the 4 members of the AFCE that year all had one of the 5 easiest schedules) and a team that went 16-0 the previous year dropped by 5 wins. Also, Cassel is no slouch, he got KC to the playoffs 2 years later at 10-6.","score":"33","subreddit":"nfl"}
{"body":"#thebradyrule\n\nAny starting QB over the age of 35 is officially allowed to take the first 4 weeks off","score":"18","subreddit":"nfl"}
{"body":"A report came out that the equipment manager locked it up right after the game to make sure nobody stole it, knowing that people would be after it.\n\nEdit: Since people asked for it, source: http://nesn.com/2017/02/someone-stole-tom-bradys-super-bowl-li-white-patriots-jersey/\n\nEdit 2: And of course to make me look like an idiot, the source released a later update. &gt;.&lt;","score":"27","subreddit":"nfl"}
{"body":"Von Miller outcoached BB by murdering tom brady.  \n\nVon Miller outcoached the Panthers in the superbowl too. ","score":"23","subreddit":"nfl"}
{"body":"like an actual goat or like a tom brady? Because I would prefer the latter","score":"50","subreddit":"nfl"}
{"body":"As a lifelong Pats fan and brady fanboy, who the fuck wants to spend $250+ on a jersey? That's insane. My Brady throwback jersey was like 150 and even that felt ridiculous. ","score":"11","subreddit":"nfl"}
{"body":"&gt;better than everybody in the league but brees and brady\n\nI am fucking triggered.","score":"39","subreddit":"nfl"}
{"body":"[*Sigh* \"God, how do I start the first sentence?\"](http://movietvtechgeeks.com/wp-content/uploads/2015/01/patriots-lose-to-bills-while-tom-brady-sits-out-nfl-2015-images1.jpg)","score":"70","subreddit":"nfl"}
{"body":"Pls?? A brees vs brady superbowl is what im lacking in my life.","score":"62","subreddit":"nfl"}
{"body":"Honestly i think BB, retires when Brady retires. I don't see him coaching into his 70's. Also If he wants to last a couple years after brady, then i think they keep jimmy, but if he wants to retire when brady does, Then they trade him and go ham for the next 2-3 years. ","score":"25","subreddit":"nfl"}
{"body":"brady - greatest QB In the game !!!","score":"12","subreddit":"nfl"}
{"body":"its a tax law. Butler had to pay taxes on the cost of the car, and for brady to give it to him, he would have had to pay the taxes. So they solved it by gifting it to butler instead of brady","score":"13","subreddit":"nfl"}
{"body":"That was absolutely the string of logic by the time they were in the court with Berman. I read every transcript and every court document.  Wells even stated that bradys cell phone made him question his credibility and seemed as if he was hiding something. \n\nWhen the court ordered the NFL appeal transcripts released that was when the NFL started hammering the cellphone. ","score":"14","subreddit":"nfl"}
{"body":"I mean I just posted [this](http://espn1005.com/wp/wp-content/plugins/rss-poster/cache/29e77_nfl_manning_brady_freaky_sunday_b2_576x324.jpg) in a separate thread a few hours ago, but it's relevant again so...","score":"23","subreddit":"nfl"}
{"body":"yeah listen to this guy. I really hate to say this but i would chose a patriots game when they travel to the west coast. I know youre not that into football but they have brady who...fuck i hate saying this but who's the greatest of all time. to say you got to see him live would be cool. not that many people have that luxury. ","score":"21","subreddit":"nfl"}
{"body":"2nd Canadian update. So I just witnessed a woman in a brady shirt yell really loud. And then take a large gulp out of a pint of Molson Canadian. Then she violently grabbed some guy by the face (who was supporting the falcons) there were slapping sounds, it was violent.\n\n\nThen she very loudly yelled woo right in his face. Tldr how desperate Patriots fans are","score":"19","subreddit":"nfl"}
{"body":"I wanted the Patriots to lose, not necessarily because I hate brady, but because that would put them one game closer to our SB record, and that makes me sad","score":"16","subreddit":"nfl"}
{"body":"Hes really solid. People think if you dont have a tom brady or rodgers you need to keep looking for one but you CAN win with Tyrod at qb. Love him","score":"16","subreddit":"nfl"}
{"body":"Tom brady wins a Superbowl where others have failed 93 times and gets to go home and pork a super model","score":"14","subreddit":"nfl"}
{"body":"tom \"general sherman\" brady","score":"23","subreddit":"nfl"}
{"body":"But butler got the truck.  It was a weird tax thing where brady would have to fork over like 50 grand if he just gave the truck to butler or something fucking stupid like that but they sorted it out in the end. ","score":"69","subreddit":"nfl"}
{"body":"Still don't have tom brady","score":"16","subreddit":"nfl"}
{"body":"somebody in your sub said he's gonna be better than everybody in the league but brees and brady","score":"18","subreddit":"nfl"}
{"body":"[Here's a breakdown](http://www.cincyjungle.com/2013/3/5/4065394/a-history-lesson-on-2013-nfl-free-agency-remember-plan-b-free-agency).  Teams used to basically hold the rights of players forever. Then in 1989, \"Plan B\" free agency was instituted that allowed teams to retain the rights to \"only\" 37 players.\n\nEight players sued to end this practice, and that's what ultimately led to our current system.  Fun fact, during this process, Pat Bowlen was so worried about losing John Elway that he lobbied for the inclusion of some sort of mechanism for teams to be able to protect a star player, and the franchise tag was born.\n\nSome additional info about the involvement of Reggie White and Plan B free agency:\n\n[In-depth legal breakdown of 1993 settlement](http://www.leagle.com/decision/19932294836FSupp1458_12126/WHITE%20v.%20NATIONAL%20FOOTBALL%20LEAGUE)\n\n[NY Times article about 1992 jury trial over Plan B free agency](http://www.nytimes.com/1992/09/11/sports/football-nfl-s-free-agency-system-is-found-unfair-by-us-jury.html) \n\nWhite was one of the named plaintiffs in a class action case filed just two weeks after the 1992 case mentioned in the NYT link that challenged what was known as [Plan B Free Agency](https://en.wikipedia.org/wiki/Plan_B_free_agency). The case was heard by Judge Doty of the 8th circuit who came to be viewed as player friendly, and he continued to hear CBA related cases, including the lawsuit over the lockout, which is why the NFL proactively [asked a NYC court to uphold the Brady suspension](http://mweb.cbssports.com/nfl/eye-on-football/25252540/report-nfl-requests-nyc-court-to-uphold-tom-brady-appeal-ruling) (mobile link) so that they had less of a chance to wind up in Doty's Minnesota court again. ","score":"28","subreddit":"nfl"}
{"body":"How can you not love gronk. Dude just wants to ball. I've had the biggest man crush on him since he got drafted and was jumping around with his family and gushing about how excited he was to play with brady. ","score":"86","subreddit":"nfl"}
{"body":"Well Matt Ryan has a perfect Passer rating right now... So I'd assume it has to be him. \n\nedit: hahahahaha im an idiot for ever doubting brady","score":"26","subreddit":"nfl"}
{"body":"I read this as \"Tom brady and Matt Ryan share a joint In training camp\" Then  I remembered Tom only eats avacodos.","score":"125","subreddit":"nfl"}
{"body":"I feel bad for Jimmy G..... two super bowl wins and the guy still can't get a high five.... he is the next brady confirmed ","score":"59","subreddit":"nfl"}
{"body":"Randy moss asked him to talk about tom brady's greatness ","score":"16","subreddit":"nfl"}
{"body":"wilson is one of the few young threats to the brady/brees/maning/farve group's records\n\nwilson has insane amount of playoff wins as well, he will pass manning in playoff wins in a season or 2. Is probably the only threat to brady's playoff stats.\n\nregular season rogers, stafford and ryan are above him in the other chases accept wins. \n\n","score":"12","subreddit":"nfl"}
{"body":"#oh my god is brady crying?","score":"15","subreddit":"nfl"}
{"body":"brady should just say fuck it and go full peyton manning\n\ncall your own plays","score":"16","subreddit":"nfl"}
{"body":"Riding home and the bus was playing some Boston sports radio station...first caller: \"yeah, i mean we should still talk about manning v brady as the GOAT\".\n\nRetards everywhere, man\n\n","score":"18","subreddit":"nfl"}
{"body":"That bit Sanu said about the long halftime, it reminded me of a Brady interview before the Super Bowl:  http://www.weei.com/sports/boston/this-just-in/213041746/brady-gets-protective-necklace-gisele\n&gt;It’s a long day. It’s a long game. There’s long breaks, long halftime, long pre-game, a lot of emotional energy. I think sometimes what happens is as the game goes on… we scored two touchdowns in the fourth quarter against Seattle. I think some of the best football needs to be played at the end. So, you can’t waste all your energy before that.\n","score":"246","subreddit":"nfl"}
{"body":"No, they did not break the rules.  The NFL, by their own admission, did not know what the ideal gas law was.\n\nhttp://profootballtalk.nbcsports.com/2015/08/05/transcript-proves-nfl-didnt-know-air-pressure-could-drop-naturally/\n\nDozens of university professors sent a document to the courts during the trial explaining that the deflation was expected in cold weather.  But that doesn't even matter.  This is something that is taught in middle school science classes across the country. You can do the experment at home by yourself.\n\nhttp://profootballtalk.nbcsports.com/2016/05/25/scientists-submit-brief-in-support-of-tom-brady/\n\nIf you take a ball inflated to the lower-limit of the allowed PSI (12.5), then bring it outside in ~40 degree temperatures for 90 minutes (similar to the AFC Championship game), then bring it back inside and measure it again, the PSI will be lower.\n\nAdd that to the fact that the NFL was using two gauges to measure pressure, one of which consistently returned readings 0.4 PSI lower than the other.\n\nThese two things together give you the PSI readings seen in the data recorded from halftime during the game, and published in the Wells Report.  (Worth noting, 3 of the 4 Colts balls were below the allowed minimum, as well, but they stopped measuring.  They also recorded PSI measurements for games in the 2015 season, but refuse to release them.)\n\nDeflategate *literally* never happened.  But the Patriots were punished for it, anyway.","score":"11","subreddit":"nfl"}
{"body":"God i wish brady was a bear ","score":"12","subreddit":"nfl"}
{"body":"congrats brady enjoy the giselebration &amp; send nudes plz\n\n","score":"16","subreddit":"nfl"}
{"body":"(highjack) From further down in this thread: [Jersey was not stolen Equipment Mgr had it for safe keeping](https://www.reddit.com/r/nfl/comments/5scdbg/tom_brady_suspects_super_bowl_jersey_was_stolen/ddeb4l1/)","score":"21","subreddit":"nfl"}
{"body":"\"It's not about discrediting brady, I just want to take credit from brady\"\n\n","score":"77","subreddit":"nfl"}
{"body":"change it to 'brady' and 'losing record' and you'll be accurate again!\n\nhttps://cdn0.vox-cdn.com/thumbor/A_qg-BiYrZLganpq4P-1gGYYGUE=/1600x0/filters:no_upscale()/cdn0.vox-cdn.com/uploads/chorus_asset/file/7576473/Brady201.jpg","score":"21","subreddit":"nfl"}
{"body":"I started liking them because the brady/Michigan connection, but have grown to be a genuine fan because of the reasons you listed.","score":"13","subreddit":"nfl"}
{"body":"what youre saying is like saying brady played a full season last year.","score":"33","subreddit":"nfl"}
{"body":"There are maybe 5 qbs I would draft to start a team today. I do not want brady or Brees at 36+. If I can't get luck, Wilson I'll take the best LT in football still on his first contact or I will take the best pash rusher on his first contract. Talented youth matter more to my expansion  franchise than a qb over 30","score":"28","subreddit":"nfl"}
{"body":"congrats brady I fucking hate you but congrats","score":"50","subreddit":"nfl"}
{"body":"hey, were we watching the same game?\n\nthe one where brady drove his team back from 25 points down, and won?","score":"19","subreddit":"nfl"}
{"body":"so no need for bill to coach you guys either since brady was the one throwing the balls and blount was running it?","score":"12","subreddit":"nfl"}
{"body":"http://www.si.com/vault/2012/01/09/106148035/tom-brady-as-you-forgot-him\n\nlink to the full article it was written in 2012\n","score":"107","subreddit":"nfl"}
{"body":"2 SBs in 3 years.\n\nIf this rate keeps up and he's there as long as brady, he should take home at least 9 rings or more depending on his defense. \n\n","score":"19","subreddit":"nfl"}
{"body":"Funnily enough, i'd say the Edelman catch is way luckier than either of the Giants miracle catches or even the curse catch.\nI love brady but that was a horrible throw into triple coverage.","score":"21","subreddit":"nfl"}
{"body":"Well then\n\nhttp://giphy.com/gifs/tom-brady-Za37223yAPOgM","score":"40","subreddit":"nfl"}
{"body":"brady's shit will be all over atlantas defense","score":"23","subreddit":"nfl"}
{"body":"brady cap hit this year is 14 mil.\n","score":"39","subreddit":"nfl"}
{"body":"how do you think belichick and brady got their second half powers?","score":"12","subreddit":"nfl"}
{"body":"Idk brady threw 62 passes 466 yards 2 tds","score":"16","subreddit":"nfl"}
{"body":"tl;dr goodell goes nuclear on the new england patriots over \"under inflated footballs\" decides to \"make an example of them\", fines brady and suspends him for 4 games, which is ironically longer than someone who was caught ON CAMERA beating his wife.\n\nAlso did I mention the fact that other than the footballs being under the PSI required by the NFL, they had literally 0 proof? And plenty of people did the math and figured that with the temperature/atmosphere at the given time, and noting the fact that Brady tends to favor balls on the lower side of the numbers required, it's entirely possible that the balls simply dipped under the required numbers due to the effects of the temp/atmosphere on the balls?\n\n","score":"23","subreddit":"nfl"}
{"body":"[500 000](http://nep.247sports.com/Bolt/ESPN-estimates-value-of-Tom-Bradys-missing-Super-Bowl-jersey-51160204)\n\n[400 000 or more](http://time.com/money/4661084/tom-brady-2017-super-bowl-jersey-stolen-value/)\n\n[300 000](http://www.usatoday.com/story/sports/nfl/2017/02/06/game-worn-super-bowl-jersey-tom-brady-stolen/97564466/), lowest single value I've seen\n\n[250 000 - 500 000](http://www.wcvb.com/article/brady-s-missing-super-bowl-jersey-could-be-millions/8690045)\n\n[Could possible reach a million or more](http://parade.com/545759/nancyberk/whats-tom-bradys-super-bowl-jersey-worth-an-expert-weighs-in-on-sports-collectibles/)\n\n[Start bidding at 300 000, likely reach 500 000](https://www.bloomberg.com/news/articles/2017-02-06/brady-s-missing-super-bowl-jersey-could-get-500-000-at-auction)\n\nA quick google search will give you these.","score":"29","subreddit":"nfl"}
{"body":"For perspective:\n\nUsed *regular season* Brady Jersey from 2012 sold for $46K\n\nUsed *regular season* Brady Jersey from 2014 sold for $54K at auction\n\nhttp://time.com/money/4661084/tom-brady-2017-super-bowl-jersey-stolen-value/\n\nBrady has only worn 7 SB jerseys ever compared to 250-275ish regular season jerseys","score":"11","subreddit":"nfl"}
{"body":"Man you broncos fans bring up brady in unrelated threads even more than pats fans do now.","score":"11","subreddit":"nfl"}
{"body":"guys put a tom brady face in there quick af! ","score":"12","subreddit":"nfl"}
{"body":"why would you ever leave at half time with tom brady down?","score":"14","subreddit":"nfl"}
{"body":"Sad brady [is sad](http://imgur.com/a/5C00U)","score":"46","subreddit":"nfl"}
{"body":"When brady passed on 1st down and it was in the defenders fingertips I was like \"OH MY FUCKING GOD DID THEY JUST DO THE THING THAT SEATTLE DID AGAINST THEM\" and then it was incomplete and I knew they would just run it in.","score":"71","subreddit":"nfl"}
{"body":"Full quote \n\n&gt;“I don’t really think that is necessarily the case,” he said, relaxing in ski pants and sneakers. “I think it was one of the greatest games I have ever played in, but when I think of an interception return for a touchdown, some other missed opportunities in the first 37, 38 minutes of the game, I don’t really consider playing a good quarter-and-a-half, plus overtime as one of the ‘best games ever’ but it was certainly one of the most thrilling for me, just because so much was on the line and it ended up being an incredible game. There are so many things that played into that game—a high-scoring offense, a top-ranked defense, the long Super Bowl, four-and-a-half-hour game, the way that the game unfolded in the first half versus what happened in the second half … so it was just a great game.”\n\n[Source] (http://mmqb.si.com/mmqb/2017/02/13/tom-brady-montana-super-bowl-51-nfl-patriots-peter-king)\n\nGreat read btw.","score":"741","subreddit":"nfl"}
{"body":"Whoa there, calling brady the GOAT is fine but calling Manning and Montana 2nd tier because they played on other teams is just moronic. Pretty sure Brady will retire with the Pat's but if he loses a step he may need to pull a Favre to keep playing. The pats aren't as sentimental as the fans are. ","score":"12","subreddit":"nfl"}
{"body":"Oh god, oh brady","score":"20","subreddit":"nfl"}
{"body":"&gt;Well, one superstar in basketball is worth way more than one superstar in football.\n\nIn some ways sure, as that goes with the territory of the sport. However, one could easily argue that it's way easier to get stars deep in drafts (brady and montana to name 2), whereas in the NBA it's virtually unheard of. \n\n&gt;It's also easier to lock him down once you've got him so while it's harder to get to the top it's much easier to stay up there in basketball.\n\nI don't see the evidence of this. Franchise tags don't exist in the NBA. Additionally, guys like Brady, Manning, Rodgers and Brees have all not left on their own accord (Manning and Brees were basically let go of). ","score":"11","subreddit":"nfl"}
{"body":"I think you're confusing QBs with Players right now. Top 10 players includes guys like Jerry Rice and LT and makes ranking them even more difficult. It's so subjective you could easily argue different guys through history over brady. ","score":"21","subreddit":"nfl"}
{"body":"Edelman really looks up to him and just repeats whatever he says lol.\n\nJE: “Are you happy? I’m not happy.” \n\nTB: “I’m happy.” \n\nJE: “I’ll be happy next week when we get the other one.” \n\nTB: “I’m (expletive) happy.” \n\nJE: “I know you’re happy. I’m a little happy, too.”\n\n\nhttp://nesn.com/2017/01/julian-edelman-to-tom-brady-in-afc-title-win-are-you-happy-im-not-happy/","score":"277","subreddit":"nfl"}
{"body":"Jim Harbaugh says Brady is the best football player of all time: \n\n*If you can play that good, that consistently great year-after-year-after-year-after-year, game-after-game-after-game-after-game, nobody’s ever done that. Nobody’s ever done it like Tom Brady has. He’s the best of all time*.”\n\nhttp://profootballtalk.nbcsports.com/2017/02/01/jim-harbaugh-tom-brady-is-the-greatest-football-player-ever/related/","score":"22","subreddit":"nfl"}
{"body":"dank memes can melt tom brady's dreams","score":"11","subreddit":"nfl"}
{"body":"This kind of game won't lead to angry brady it will lead to sad, depressed, possibly suicidal Brady.\n\n\nGiselle is gong to see two feet covered in uggs hanging from the rafters","score":"11","subreddit":"nfl"}
{"body":"Is it though? Take away brady's rings and peyton's rings and put them next to marino. Now compare whatever you want..... efficiency, volume stats \n\nI would say marino ","score":"11","subreddit":"nfl"}
{"body":"I wanna see brady give goodell a stunner and I never knew that until now","score":"11","subreddit":"nfl"}
{"body":"It's clear to me that part of his 'cooling' system is in his hands, as he is simply spreading his fingers for maximum cooling. I agree however, on the [difficulties of understanding human social interaction](http://www.totalprosports.com/wp-content/uploads/2013/12/10-tom-brady-high-five.gif)","score":"11","subreddit":"nfl"}
{"body":"seahawks fan, but as a heterosexual, married male, tom brady makes me feel things","score":"12","subreddit":"nfl"}
{"body":"Vick could've been the best ever if he had the work ethics of Tom brady.  His success he had was attributed to his pure athleticism. ","score":"12","subreddit":"nfl"}
{"body":"i think super bowl 49 was a better game all around with just as inconceivable a finish.\n\nmore than anything, this sets the benchmark performance for legendary quarterbacking in the big game. the amount of people that STILL tell me brady only won on the leg of vinatieri and lacked any outstanding sb moments now have nothing to lean on.","score":"362","subreddit":"nfl"}
{"body":"Tom brady is /u/_COWBOY_DAN confirmed","score":"20","subreddit":"nfl"}
{"body":"IDK what you mean by \"mistakes\" but if you are taking ints, brady has a considerably smaller int% than Manning and since 08 a similar int% to aaron rodgers. ","score":"18","subreddit":"nfl"}
{"body":"well technically brady to minnesota in february next year","score":"42","subreddit":"nfl"}
{"body":"don't let tom brady's jersey distract you from the fact that Patrick Kane's 2010 Stanley Cup winning goal puck is still missing","score":"89","subreddit":"nfl"}
{"body":"brady losing a tough fought battle against a fiesty defensive front that almost beat us in week 17, undefeated or not, looks way better than  losing by 25+ in the super bowl. people lovvvvvvvve to hate brady. we would never hear the end of brady losing by 25+ in a super bowl and in a way more annoying way than \"18-1 lol\"   \n\n\ngetting made fun of for being 1 game away from being undefeated woudl be a lot easier to swallow than hearing how we TOTALLY laid and egg and lost by 25+. \n\n\nmanning taking the number 1 offense ever and losing by 35 points is probably the most overlooked failure in sports. peyton isnt as hated or as \"cool\" to hate as brady, so it largely gets overlooked, but as someone who doesnt like peyton, thats probably the worse loss i can think of in sports and i would never want brady to associate with anything like that. ","score":"11","subreddit":"nfl"}
{"body":"http://imgur.com/a/E95c0\n\nfucking brady ruined my meme","score":"38","subreddit":"nfl"}
{"body":"your fans are really, really passionate. i spent the first 23 years of my life in Massachusetts and moved here in august of 2015. 23 years of hating the jets, dolphins, ravens, steelers etc. \n\nthis city has managed to get me to overlook 23 years of built up hatred of longtime rivals to hate the eagles more than any of them.  your rich football culture and rabid fanhood is remarkable. not a single sunday has gone by in the past year and a half where i wasnt given massive shit for leaving my house in a brady jersey. 94.1 seems to talk about the patriots several times a week and it turns into a giant echo chamber of fans calling in and stating ways in which we cheated back in 2004, that are completely untrue (and sometimes completely absurd) like its proven fact. No city can hold a grudge like this. its awesome. you hate the patriots for a super bowl 11 years ago, more than i hate possibly anything in the world. its incredible. you guys will climb the mountain some day and this city will explode. this cities fans are incredible. you deserve one. \n\ni hate you guys. really do. but god damn do i respect your passion.","score":"135","subreddit":"nfl"}
{"body":"i was thinking just get a few yards and go for a 55+ yarder to win the game. lets be real, once they punted it we all knew what was going to happen next. it didnt matter if you gave brady great field position or terrible field position. plenty of time left 2 timeouts he was scoring regardless. its like that time against the colts you guys went for it on 4th and short on your side of the field. either trust one of the greatest qbs of all time to get a couple yards or trust your defense to stop one of the greatest qbs of all time. ","score":"32","subreddit":"nfl"}
{"body":"what i was right about: i didn't think the cardinals would have a winning season, i thought the jags would suck despite all the hype \n\nwhat i was wrong about: tom brady ","score":"29","subreddit":"nfl"}
{"body":"just shows you that brady is on a different tier than manning. i mean this game was about to become a seahawks-broncos game repeat... then bam","score":"148","subreddit":"nfl"}
{"body":"so did brady just become the best qb of all time in the best superbowl of all time?","score":"38","subreddit":"nfl"}
{"body":"Holy shit I paid 50 bucks for a brady autographed ball after that first sb","score":"114","subreddit":"nfl"}
{"body":"Instead of linking to the article, this links to Peter King's fucking twitter account. I don't get reddit sometimes:\n\n http://mmqb.si.com/mmqb/2017/02/13/tom-brady-montana-super-bowl-51-nfl-patriots-peter-king","score":"31","subreddit":"nfl"}
{"body":"Spin it however you want, Brady should have had 100% of the snaps his senior year    \nhttp://www.detroitnews.com/story/sports/college/university-michigan/2017/02/10/bacon-michigans-tom-brady-has-always-beaten-odds/97734448/","score":"21","subreddit":"nfl"}
{"body":"someone in another thread mentioned the possibility of the falcons holding intentionally to give the line more time to pressure/knock down brady to set the tone in exchange for 5 yards here and there. i thought it made sense at first, but those holds came on 3rd downs to extend drives so that really doesn't hold up. i think the falcons' terrible pass defense from the season just happened to be overachieving for most of the game.","score":"38","subreddit":"nfl"}
{"body":"Man i hope nobody sees this hard-on Im getting from brady getting his ass plowed every other play","score":"13","subreddit":"nfl"}
{"body":"So they can prove that it doesnt matter and brady is unstoppable? no thanks, we don't need any more angry brady scenarios.","score":"46","subreddit":"nfl"}
{"body":"yeah exactly. besides, people are forgetting one thing. and that is, as good a season as matt ryan has had, hes not tom brady. \n\nwhat i mean by that is, he doesn't take scrub, no name guys like danny amendola or chris hogan and turn them into probowlers. or maybe he can, but we haven't seen him to it. no disrespect to matt ryan, but the weapons hes had throughout his career in atlanta have been insane. roddy white, tony gonzales, michael turner, devonta freeman and how can i forget, julio motherfucking jones. \n\nif ryan would have come to baltimore, forget the fact that he wouldn't have had our best RB in the last decade (ray rice), but he would have also had to make do with everything flacco has had to make do with. out of prime derrick mason. mark clayton. etc etc. flaccos best weapons have been a slightly older boldin, a perpetually injured dennis pitta and ray rice (whos already out of the equation). \n\ntheres no doubt in my mind that ryan would not have the stats he has today, had we drafted him. period. flacco gets us the same, if not more wins. but we didn't have to mortgage our initial draft to get flacco, which might have ended up costing us our eventual SB run. \n\nso all that being said, Im completely fine with how things played out. ","score":"40","subreddit":"nfl"}
{"body":"&gt; Talent wise, most people wouldn't put Favre near the top 10.\n\nThis has to be a joke. Talent is why Favre is considered one of the greats. Talent-wise, he's easily top 5.\n\nLook at any greatest QB list and none will leave Favre off the top 10. None will have Romo anywhere near the top 10. \n\n[On this list](http://ftw.usatoday.com/2016/12/greatest-quarterbacks-ever-rankings-list-tom-brady-peyton-manning-joe-montana-dan-marino-drew-brees-brett-favre-johnny-unitas-goat-stats), they try to give a number to each player's attribute. Notice Favre is one of only 5 players to get a 10 on talent. Notice Favre is #4 overall. Notice Romo is nowhere on the top 20.","score":"11","subreddit":"nfl"}
{"body":"brady should play for the veterans minimum. the dude has enough money","score":"45","subreddit":"nfl"}
{"body":"peyton manning was absolutely miserable in the 2006/2015 playoffs. both of his super bowls are directly because of his defense. why are you trying to act like manning never benefited from good defenses?  he would be winless without them. \n\n\n**r/nfl before playoffs:** pats defense is so overrated. havent played a single top 10 qb. havent been tested at all. steelers will win. \n\n**r/nfl after brady rips off 28 straight to complete biggest SB comeback:**  lol. scrub. cant do shit without his defense. always has god-level defenses. \n\n\n**Edit: OP got his facts wrong. brady is 12-6 and 2-1 in super bowls without top 5 scoring defenses. let me paste this here to show you how wrong he was: thanks u/lmm310**\n\nThe Patriots didn't have a top 5 scoring D in 2001.\n\nWith top 5 scoring D: 2003, 2004, 2006, 2007, 2009, 2016\n6 Seasons | 5 AFCCG appearances | 4 Superbowl appearances | 3 Superbowl wins\n\n13-3 playoff record\n\nWithout top 5 scoring D: 2001, 2002, 2005, 2010, 2011, 2012, 2013, 2014, 2015\n9 Seasons | 6 AFCCG appearances | 3 Superbowl appearances | 2 Superbowl wins\n\n12-6 playoff record\n\nEdit: The 2 Superbowl wins without a top 5 scoring defense is a tied record.\n\nEdit: The 12 playoff wins would put him tied for 7th in all-time playoff wins. If you eliminated all wins with a top 5 defense for every QB, Brady would be 1st.\n\nEdit: In Brady's 5 superbowl winning runs, the defense allowed an average of 18.5 points per game. That's higher than Montana (4 runs, 12.4 ppg), Bradshaw (4 runs, 13.5 ppg), Aikman (3 runs, 9.0 ppg), Starr (2 runs, 15.0 ppg), Griese (2 runs, 11.8 ppg), Staubach (2 runs, 6.8 ppg), Plunkett (2 runs, 12.7 ppg), Elway (2 runs, 14.8 ppg), Peyton Manning (2 runs, 15.6 ppg), Roethlisberger (2 runs, 17.6 ppg) and Eli Manning (2 runs, 15.1 ppg), aka every QB who won multiple Superbowls, if I'm not mistaken.","score":"95","subreddit":"nfl"}
{"body":"[He's pliable.] (http://cdn1.thecomeback.com/wp-content/uploads/sites/94/2016/12/jon-gruden-tom-brady-hat.jpg) ","score":"42","subreddit":"nfl"}
{"body":"lol deleted comment about brady having a bad relationship with his mother and that's why she might not show.\n","score":"117","subreddit":"nfl"}
{"body":"LOL montanna was throwing to jerry fucking rice bro, Brady hasn't even had a healthy Gronk for a majority of his SB. Brady just came back from 25 down throwing to a couple white guys who look like they played for d2 schools. I'm not saying Montana isn't an all time great, but at this point, wtf else can you argue against brady. Dude is a football demi god, 2 10+ 4th quarter comebacks in the SB, the first and only overtime SB game winning drive, most ever super bowl rings by qb, most ever SB appearances by a QB, beat arguably the greatest defense of all time in 14, 5 game winning 4th quarter or OT SB drives etc... the list just goes on and on","score":"11","subreddit":"nfl"}
{"body":"that's a shitty excuse. the pats had 3 qbs already when they drafted brady","score":"14","subreddit":"nfl"}
{"body":"ATL can do this all night - give them free yards 5 at a time while getting to smash brady every time.  he'll break before the goal line does","score":"18","subreddit":"nfl"}
{"body":"after brady retires at 45, Belichick moves onto the browns to finish what he started, winning 5 straight championships. Brady, not one to be outdone, unretires at the tender age of 50, joins the Texans and in the AFC championship brings the Texans back from a 25-2 deficit to win the game. ","score":"27","subreddit":"nfl"}
{"body":"It literally is http://boston.cbslocal.com/2015/04/16/throwack-thursday-when-tom-brady-became-best-decision-patriots-ever-made/","score":"157","subreddit":"nfl"}
{"body":"word.  Favre is the opposite of brady.  Dude would wait until preseason to announce he wasn't retiring so he wouldn't have to participate in offseason workouts every year.   Meanwhile Brady is flying team mates in to host his own offseason workouts at his house/local highschool fields. ","score":"21","subreddit":"nfl"}
{"body":"After the pick 6 I thought it was gonna be near impossible to come back. Didn't fully count them out tho cause brady and belichick are brady and belichick ","score":"33","subreddit":"nfl"}
{"body":"[Tim Brown still thinks Tom Brady wouldn't be a starter without the tuck rule.](http://www.nfl.com/news/story/0ap3000000781644/article/tim-brown-tom-brady-not-starter-without-tuck-rule?campaign=tw-articleshare)","score":"65","subreddit":"nfl"}
{"body":"yeah in brady's tenure I think we've played only 3 wild card matches out of 14 playoff runs.\n","score":"153","subreddit":"nfl"}
{"body":"Tom brady","score":"18","subreddit":"nfl"}
{"body":"Only problem with brady is he has the greatest coach of all time on the sideline","score":"18","subreddit":"nfl"}
{"body":"I aid this in another thread:\n\n[Go watch the Brady-Goodell handshake. Goodell tries to leave the handshake and Brady doesn't let go.](http://www.sbnation.com/2017/2/5/14518442/roger-goodell-tom-brady-handshake-super-bowl-2017)\n\nIf you ever read books on body language (there are some great ones related to poker tells), Goodell has his feet turned away the entire time, says his quick, \"great game\", and tries to quickly retreat. Those are all \"flight moves\" in terms of \"fight or flight.\" \n\nBrady squares him up, and doesn't let Roger leave until he's finished saying his piece.  Even if he's saying \"Thanks, man. That means a lot.\" His body language is saying, \"I own you.\" \n\nThat's way more of a statement. ","score":"12","subreddit":"nfl"}
{"body":"[Looks like it was equipment manager - took it to safety.](http://nesn.com/2017/02/someone-stole-tom-bradys-super-bowl-li-white-patriots-jersey/)","score":"47","subreddit":"nfl"}
{"body":"I rewatched the Giants/Pats 07 Superbowl\n\nWhat if brady hit Moss over top at the end with 10 seconds left. ","score":"28","subreddit":"nfl"}
{"body":"I hate how most of the credit goes to Belichick, Brady is the reason why despite our gaps in talent which is usually mostly on the offensive side we are able to make things work.  You can write the best game plan in your life but as you saw in the superbowl if the players don't execute them you go down 28-3. People talk about how we haven't seen Brady without belichick but we have seen belichick without brady and he was nowhere near successful.  People bring up Matt Cassel but he was a pro bowl qb after he left NE, so lets not pretend like Matt Cassel was only good with his time with NE. ","score":"21","subreddit":"nfl"}
{"body":"If we hadn't made the comeback, [this one](http://cdn1.thecomeback.com/wp-content/uploads/sites/94/2017/02/bradySBLI_INT-832x447.jpg) would have been a good choice as well.","score":"93","subreddit":"nfl"}
{"body":"its funny, Tom winning his 5th in a miraculous comeback and on a literal perfect fourth quarter effort, has somehow made brady haters even more entrenched and convinced brady isnt goat. really makes you understand that peoples opinions dont matter and that no matter what they will believe what they want. ","score":"55","subreddit":"nfl"}
{"body":"Sorry i meant brees should be 4-0 against brady. The one win for Brady was a retarded fluke. ","score":"38","subreddit":"nfl"}
{"body":"LET ME BREAK IT DOWN FOR YOU. http://giphy.com/gifs/tom-brady-10YDcM18KiVPO0","score":"38","subreddit":"nfl"}
{"body":"[Brady: Joe Montana sucks] (http://www.theonion.com/article/tom-brady-joe-montana-sucks-and-i-am-better-than-h-37788)","score":"133","subreddit":"nfl"}
{"body":"[Everyone sucks but me!](http://img.pandawhale.com/post-52958-simpsons-tom-brady-everyone-su-Tt9w.gif)","score":"15","subreddit":"nfl"}
{"body":"[found tom brady's retirement home](http://i.imgur.com/mWWJkk5.jpg)","score":"796","subreddit":"nfl"}
{"body":"The greatest smartest move was to remove blount from the game !! I felt super happy after that move. Running game imrpoved by leaps and bounds. Made brady more comfortable throwing on 2nd and 3rd downs. \n\nRespect Belchick for the move _/\\_","score":"28","subreddit":"nfl"}
{"body":"Time to pull out [this monstrosity again](http://espn1005.com/wp/wp-content/plugins/rss-poster/cache/29e77_nfl_manning_brady_freaky_sunday_b2_576x324.jpg)","score":"44","subreddit":"nfl"}
{"body":"im sorry, but when you scoff at other fanbases giving your team a compliment because the compliment wasn't good enough for your delicate brady sensibilities it makes you look like a jerk.  \n","score":"23","subreddit":"nfl"}
{"body":"[Did Brady really set the bar all that high?](https://dubsism.files.wordpress.com/2011/09/tom-brady-scout-combine.jpg?w=400)","score":"95","subreddit":"nfl"}
{"body":"cardale... jones? people are saying cardale could be brady/montana?","score":"11","subreddit":"nfl"}
{"body":"Tommy. We all misunderstood him, when in reality he was just [a fortune teller ahead of his time](https://www.google.com/search?rlz=1CDGOYI_enUS733US733&amp;hl=en-US&amp;ei=iIuxWNCRLeaJ0wLGiLfYDA&amp;q=tom+brady+high+five+gif&amp;oq=tom+brady+high+five+gif&amp;gs_l=mobile-gws-serp.3...1501.2068.0.2199.4.4.0.3.3.0.124.352.3j1.4.0....0...1c.1.64.mobile-gws-serp..0.1.123...0.9uYqrsVNqTY#imgrc=82eVQgWWtFTW5M:)","score":"12","subreddit":"nfl"}
{"body":"I keep hitting \"new\" to get more and more brady stats. I feel like im edging","score":"156","subreddit":"nfl"}
{"body":"i like the theory that brady is pretending it was stolen so that rodger cant force him to give it to the HOF and he can give it to his mom instead","score":"18","subreddit":"nfl"}
{"body":"does brady always give the car away?  i seem to recall him passing it along two years ago as well...\n\nit's a cool move.  good on brady getting that mvp, though the gambler in me wishes it had been white since i had a couple bucks on that long shot...","score":"53","subreddit":"nfl"}
{"body":"Every one makes fun of that, but because the jets were laughing so hard they didnt stop blount and he got a first down. \n\nAlso brady released a pretty funny video of that block later that night.\n\nhttps://www.facebook.com/TomBrady/videos/vb.214003275307497/1331145090259971/?type=2&amp;theater","score":"93","subreddit":"nfl"}
{"body":"Tom once said \"[When I suck, I'll retire](http://profootballtalk.nbcsports.com/2014/09/02/tom-brady-when-i-suck-ill-retire/)\"\n\nDoes that mean he'll retire at halftime?","score":"11","subreddit":"nfl"}
{"body":"I love this game so far fuck tom brady","score":"12","subreddit":"nfl"}
{"body":"brady trying to do the aaron rodgers thing...","score":"17","subreddit":"nfl"}
{"body":"Little did we know, all the hate from this thread fueled tom brady to do this to the poor Falcons. We played ourselves","score":"31","subreddit":"nfl"}
{"body":"i stopped watching with 13 minutes left in the fourth quarter..i'm such an idiot. how is this even possible is tom brady real","score":"15","subreddit":"nfl"}
{"body":"Some would say he's even better looking than [our current QB](http://static.socialitelife.com/uploads/2011/06/tom-brady-dog-ugg-boots-commercial-06162011-11-682x675.jpg).","score":"30","subreddit":"nfl"}
{"body":"It was definitely a dirty play, but he actually reached out to him and apologized to Reed after the game. Didn't like the play, but Brady owned up to it\n\nhttp://www.nfl.com/news/story/0ap1000000129579/article/ed-reed-tom-brady-texted-me-to-apologize-for-slide ","score":"20","subreddit":"nfl"}
{"body":"but you get to see brady cry? isn't that better","score":"17","subreddit":"nfl"}
{"body":"For real. I have a few pieces of brady memorabilia I should check the market value of apparently lol","score":"31","subreddit":"nfl"}
{"body":"you can find it [right here, my friend](http://mmqb.si.com/mmqb/2017/02/13/themmqb-podcast-peter-king-tom-brady-talks-super-bowl-51-comeback-julian-edelman-bill-belichick)","score":"17","subreddit":"nfl"}
{"body":"i dont get how the greatest QB of all time, who has come back from countless big leads and lead late super bowl victory drives now 4 times, is getting less credit in favor for the falcons \"choking\"\n\nThis is the patriots, everyone, like it or not. they are better coached, qb'd and prepared for everyone else.  They played like shit and shot themselves in the foot all game with terrible play, but in the end they didnt panic and clawed back.\n\nthe falcons didnt choke... they played unsustainable football in the first half.  There is zero way they could keep up how well they were playing.  its overlooked that brady marched the pats into their 30, 3 times and only came away with 3 points due to terrible choices, playcalling, and some timely turnovers by the falcons. we were still moving the ball though. in the second half we just started to convert and play pats football.\n\nFalcons \"top 5 best offense ever\" put up 21 points and our defense stepped the fuck up whenever they needed to. the better team chipped away at the lead and played big when it mattered. im not sure it was a choke. it was just the patriots being the patriots. ","score":"12","subreddit":"nfl"}
{"body":"So I was screwing around with pro football reference stuff, and I learned something pretty cool. Even though other teams (84 49ers, 85 bears, 98 vikings, 04 steelers, 2011 packers) went 15-1, none of them stsrted the same qb for the entire year. Which means tom brady and cam Newton are the only two quarterbacks to win 15 regular seasons games on one season.","score":"13","subreddit":"nfl"}
{"body":"I mean, we always are at superbowl or bust in brady's era. ","score":"13","subreddit":"nfl"}
{"body":"damn how you gonna let brady run for a first down LMAO","score":"16","subreddit":"nfl"}
{"body":"Eh, i don't mind brady","score":"29","subreddit":"nfl"}
{"body":"[John Clayton doesn't even think he's top 15 all time...](http://www.espn.com/nfl/story/_/id/18581054/greatest-quarterbacks-all-ranking-john-clayton-picks-tom-brady-new-england-patriots-best-nfl-qb-ever)","score":"17","subreddit":"nfl"}
{"body":"Lebron is hated way more than brady. ","score":"18","subreddit":"nfl"}
{"body":"NO fans know more but Brees certainly comes off as someone who takes incredible care of his body and mind and wants to play into his 40's, similar to brady. If he does it he's bound to take the majority of the volume records.","score":"375","subreddit":"nfl"}
{"body":"apparently you're so used to brady you don't know what its like having the qb be a question mark for 10+ years.  \n\nbradford is light years better than anyone else we have had in the last 10+ years (favre doesnt count)","score":"18","subreddit":"nfl"}
{"body":"brady is so old","score":"12","subreddit":"nfl"}
{"body":"omg wtf brady a savage","score":"13","subreddit":"nfl"}
{"body":"Of course he didn't, but he also hasn't [claimed that he did](http://www.nfl.com/news/story/0ap3000000533581/article/bill-polian-colts-had-firstround-grade-on-tom-brady)","score":"14","subreddit":"nfl"}
{"body":"Except when they lose at home with brady","score":"14","subreddit":"nfl"}
{"body":"greatest player has to be a QB, fair or not, they're the most responsible for the success of their team\n\nmy vote would go to tom brady","score":"17","subreddit":"nfl"}
{"body":"LOLOLOLOL, finally. Fuck you brady","score":"17","subreddit":"nfl"}
{"body":"tom brady first half highlight reel:  http://imgur.com/a/vNU9C","score":"12","subreddit":"nfl"}
{"body":"So no real news, just \"well we assume they will talk about romo, assuming he is released\".\n\nI assume the broncos would pursue tom brady, assuming if he was released.\n\nI assume the patriots would discuss pursuing harry potter, assuming he was real","score":"99","subreddit":"nfl"}
{"body":"remember, even in the darkness, brady has not forsaken you","score":"157","subreddit":"nfl"}
{"body":"[Here you go!](https://www.reddit.com/r/Patriots/comments/5v6my5/can_anyone_link_the_video_of_bradys_first_td_pass/)","score":"13","subreddit":"nfl"}
{"body":"Nah, Brady will retire after he wins a 6th ring.  Goatroppolo will start his career as a starter with 3 fingers already filled and pick up right where brady left off burning everything to the ground for another generation\n\n(That is my dream)","score":"38","subreddit":"nfl"}
{"body":"Really though. Why not grapp for 6 games to keep brady young and brady finishes the season. Keep your greatest weapon healthy and good for the playoffs... worked against us.","score":"19","subreddit":"nfl"}
{"body":"NFL.com video: A Football Life:  Bill Belichick [HD](http://a.video.nfl.com/films/s2011/team-cam/w20/120117_nfln_atl_brady_belichick_football_life_3200k.mp4) [SD](http://a.video.nfl.com/films/s2011/team-cam/w20/120117_nfln_atl_brady_belichick_football_life_500k.mp4)\n\n","score":"20","subreddit":"nfl"}
{"body":"the brady GOAT threads should go away because it's indisputable now. you're welcome ","score":"368","subreddit":"nfl"}
{"body":"They get a third round comp pick by doing nothing and letting him walk in FA when some stupid team like the Texans throw $25m a year at him, and in the meantime have a good backup in case something happens to brady.\n\nTherefore the pick would have to be at least a second round pick.\n\nThe deal would have to look like the Alex Smith trade - conditional.","score":"12","subreddit":"nfl"}
{"body":"I think they targeted brady pretty regularly haha","score":"19","subreddit":"nfl"}
{"body":"REMEMBER [THIS?](http://cdn01.cdn.justjared.com/wp-content/uploads/2017/02/brady-post/tom-brady-post-super-bowl-plans-04.jpg)  4 DAYS AGO.  YEA I COULD CARE LESS ABOUT THOSE SUPER BOWLS RIGHT NOW.","score":"14","subreddit":"nfl"}
{"body":"brady looking like old Peyton","score":"14","subreddit":"nfl"}
{"body":"ELI MANNING IS THERE\n\nno wonder brady is off","score":"18","subreddit":"nfl"}
{"body":"[It may be breast cancer:](http://www.providencejournal.com/sports/20170201/tom-bradys-perspective-on-deflategate-changed-due-to-mothers-illness)\n\n&gt;On Oct. 3, during his weekly appearance on Westwood One, Jim Gray mentioned how October marked breast cancer awareness month for the NFL. Gray said, \"The NFL does it's part. You'll see a lot of pink this coming month and I know this is touching home very closely to you now.\"\n\n&gt;\"Yeah. It is. We're all touched by it in one form or another,\" Brady responded. \"You know, everybody has different challenging experiences I've dealt with it in my own family and dealing with it now. It's a great cause. It's great that the NFL recognizes this. Hopefully, this brings a lot of awareness and raises a lot of money to do a lot of great things.\"\n\n&gt;On Wednesday, at the Patriots team hotel in Houston, the Providence Journal asked Brady if he was referring to his mother during that October interview. The quarterback wouldn't confirm or deny.","score":"40","subreddit":"nfl"}
{"body":" I grew up watching the end of the montana era along with young, elway, farve, aikman and marino. Being a kid, watching those guys i saw them larger than life. The older i got analysts, relatives, parents of my friends time and time again (usially) went back to montana as #1 with most of the others in the top group. In my teens came peyton and  brady slowly climbing their  way up but by then that awe and magic of being a kid seeing the best pros had faded.  This was true of any sport, after all i grew up watching jordan and he's almsot unanimously considered the goat. \n\n\n  In my 20s  i carried that in my mind montana was the greatest &amp; most others of that era were in that top group ( along with those of past eras who i didnt get to watch) . Sure i saw manning &amp; brady with that group but there was always a slight separation of sorts &amp;  always seemed to be a rational (ie the game had changed) that either couldn't reach #1 definitively. \n\n\nI hadn't thought about it for yrs until i pressed myself to revisit it after the pateiots won the divisional round, went back and realized just how phenomenal and deserving of that #1 spot brady is. \n\nThen there was today, cementing tom and dethroning my childhood hero. \n\n","score":"107","subreddit":"nfl"}
{"body":"when you allow 31 points unanswered, its a combination of things..\n\ndefense getting gassed because that offense turned to horse shit in the 4th quarter..\n\nhow many times did falcons O snap the ball with like 15-20s left on the playclock? a fair amount. too many stalled drives in the 4th quarter..you know damn well the best way to beat brady is to keep him off the field..the falcons playcalling was mediocre in the 4th quarter\n\nalso had a chance to seal it when they got in FG range by julio's amazing catch..\n\neveryone gets a bit of blame in this collapse, the offense did the defense no favors and thats on matt ryan and the playcalling. ","score":"12","subreddit":"nfl"}
{"body":"hes too inconsistent though. i mean on paper yeah rodgers seems like the better qb, accurate, stronger arm, more mobile etc but he just has more off games than brady does. you can blame the supporting cast but there was a point where jordy nelson was the number 4 wr....  \n  \noff topic but there was a debate who is more important belichick or brady. majority said brady however i always said BB because people forget hes not just a good coach hes a good gm as well. you give BB rodgers, peyton, or brees idk if they win 5 rings but they will definitely come close. you give brady a different coach/gm and i dont think he gets 5.","score":"36","subreddit":"nfl"}
{"body":"favre and brady are very different people","score":"24","subreddit":"nfl"}
{"body":"[Quite a bit.](http://www.patspulpit.com/2017/2/6/14520794/new-england-patriots-24-new-super-bowl-li-51-records-yesterday-tom-brady-bill-belichick-james-white) 24 new Super Bowl records.","score":"45","subreddit":"nfl"}
{"body":"It all depends on if you have enough charm to pull ot off. \n\nReminds me of the tom brady snl skit on how to avoid work place sexual harassment ","score":"25","subreddit":"nfl"}
{"body":"MUAHAHAHAHA fuck you brady!","score":"31","subreddit":"nfl"}
{"body":"brady gonna get mad head from gisele","score":"17","subreddit":"nfl"}
{"body":"I'm biased and haven't watched Jordan, but Brady has now led 5 game winning drives in SB. He has 51 in his career, and I believe he is the only one above .500 when given chance to win. It's hard to top that.\n\n[Tied or trailing by eight points or fewer in the fourth quarter or overtime? Brady is your man. His 50-43 record and .538 winning percentage in these situations leads the league since 2001, among players with at least 50 total games played. Quarterbacks, on average, win about one-third of these games.] (http://abcnews.go.com/Sports/amazing-numbers-tom-bradys-march-201-wins/story?id=43968984) ","score":"18","subreddit":"nfl"}
{"body":"I don't think so, but it is apparently listed on his [PFR page](http://www.pro-football-reference.com/players/B/BradTo00.htm).  I don't know who updates that though.  I've literally never heard anyone call him \"The Pharoah\", which is also listed.\n\nI believe it was coined by this [Breaking Madden article](http://www.sbnation.com/2014/1/9/5276868/breaking-madden-tom-brady) that was inspired by some improbable comebacks in 2013.\n\nFunny enough, the author did in fact [break his own rule](https://twitter.com/jon_bois/status/828400198216998912), which he [later regretted](https://twitter.com/jon_bois/status/828444534472372225).","score":"11","subreddit":"nfl"}
{"body":"I hate brady and the pats like everyone else but jesus fucking christ are you fucking kidding me GOAT","score":"13","subreddit":"nfl"}
{"body":"nfc south is tied for last with superbowl wins and second to last in Superbowl appearances. 5 divisions have more Super Bowl wins than your division has appearances, and 12 teams have the same amount or more Super Bowl wins than your division has appearances... So yes the nfcs is not a successful division. Not even close. brady won more rings in 4 years than your whole division has ever. ","score":"14","subreddit":"nfl"}
{"body":"Fun fact: that rule was created for Carson Palmer. Palmer got his knee blown up and shortly after they made the below the knee rule. When brady got his knee blown they them amended it to say a defender who is on the ground can't lunge up at the QBs knees so to speak.","score":"48","subreddit":"nfl"}
{"body":"So brady goes to the broncos in 2038?","score":"12","subreddit":"nfl"}
{"body":"that was a VICIOUS hold, they should like ban him from the nfl for life\n\nand brady too cause he was generally aware a hold was occurring","score":"15","subreddit":"nfl"}
{"body":"This sub put a telescope up brady's asshole.","score":"33","subreddit":"nfl"}
{"body":"completely agree. The patriots were able to put up 38 points on that same defense week 17 of the regular season and then only put up 14 in the Super Bowl. brady had no time to throw and belichick had no answer for it. ","score":"11","subreddit":"nfl"}
{"body":"[It's been repeatedly reported that BB wants to win without Tom Brady in his career.] (http://boston.cbslocal.com/2014/07/21/breer-on-toucher-rich-belichick-wants-to-win-without-brady/)\n\nIt makes some sense as it would affirm that he can still do it without TB12.","score":"55","subreddit":"nfl"}
{"body":"[This man](https://snyted.files.wordpress.com/2011/05/weeeeeeetombrady.jpg?w=445&amp;h=497) is about to play [this man](https://pbs.twimg.com/media/BJwrbzMCIAEAZXC.jpg). \n\nWhat a time to be alive","score":"556","subreddit":"nfl"}
{"body":"swear to god, matt ryan is going to be hoisting the lombardi trophy over his head and aikman and buck are going to be talking about what tom brady needs to do to turn this game around","score":"24","subreddit":"nfl"}
{"body":"If brady did cheat, why hasn't the nfl released any PSI data from the past two years?\n\nIf PSI did matter, why didn't the nfl investigate the steelers alleged deflated footballs?\n\nIf there was concrete evidence of brady cheating, why didn't he get suspended right away?\n\nIf PSI mattered, why wasn't aaron rodgers investigated for overinflating footballs (which he admitted to!)?\n\nIf PSI mattered, why weren't the vikings punished for warming footballs up on the sidelines? \n\n","score":"17","subreddit":"nfl"}
{"body":"the union wouldn't allow it.  If someone like brady took a substantial pay cut it sets a horrible precedent for the labor force.  The union wouldn't let the contract go through. ","score":"12","subreddit":"nfl"}