{"sentiment_score":0.2,"magnitude":0.2,"text":"[shhhhh.....](http://profootballtalk.nbcsports.com/2015/08/27/tom-brady-once-sponsored-a-concussion-prevention-drink-too/)","comment_score":22}
{"sentiment_score":0.1,"magnitude":0.1,"text":"https://usatftw.files.wordpress.com/2013/11/bradyhighv.gif%3Fw%3D640%26h%3D360","comment_score":67}
{"sentiment_score":-0.1,"magnitude":0.1,"text":"please list some playoff stats that montana has over brady?","comment_score":11}
{"sentiment_score":0,"magnitude":0.2,"text":"packers are trash without rodgers. Pats went 3-1 without brady. ","comment_score":14}
{"sentiment_score":0,"magnitude":0,"text":"I also think tom brady masks a lot of belichick's personnel mistakes. ","comment_score":69}
{"sentiment_score":0,"magnitude":0.6,"text":"Really? This is the first ive ever heard of the patriots with brady constantly appearing in conference championships. ","comment_score":113}
{"sentiment_score":0,"magnitude":1.2,"text":"brady sucks.  Cut him.  Trade for osweiler","comment_score":13}
{"sentiment_score":0,"magnitude":0.7,"text":"what about brady in 2016 only vs. rodgers all time? \n\nthis **proves** brady is better than rodgers\n\n14:1 &gt; 4:1","comment_score":13}
{"sentiment_score":0.2,"magnitude":0.5,"text":"I don't really have a problem with this logic, but in that case tom brady should have absolutely been the MVP last year. The way he responded to a lack of receivers, running game, and O line protection was unprecedented, and I don't think another quarterback will ever have as much success in such unfavorable circumstances.","comment_score":24}
{"sentiment_score":-0.1,"magnitude":0.7,"text":"rattled tom brady was when he used to get fancy feet in the pocket and drop to the ground when no one was around him. It peaked after his ACL injury","comment_score":11}
{"sentiment_score":-0.4,"magnitude":2.9,"text":"&gt;The only reason I watch patriot games now is to cheer the other team into causing a career ending injury on brady.\n\nI mean I guess I get not liking the guy, hating on success and all that.  But wishing injury on someone over a sport is just horrible and childish.  Shame on you.  It makes me very sad knowing that you might be a parent instilling these god awful values in your kids.","comment_score":19}
{"sentiment_score":0,"magnitude":1.7,"text":"I think there is a major difference between teams running a Erhardt-Perkins offensive system and teams not running it. The differences in nomenclature reflect differences of how plays are conceptualized.\n\nThis article goes into more detail about it, in the context of the Patriots. Other teams besides them also use it however.\n\nhttp://grantland.com/features/how-terminology-erhardt-perkins-system-helped-maintain-dominance-tom-brady-patriots/","comment_score":19}
{"sentiment_score":0.1,"magnitude":0.1,"text":"http://www.cbssports.com/nfl/news/tom-brady-reveals-his-favorite-recipe-from-his-200-cookbook/\n\n","comment_score":20}
{"sentiment_score":0.2,"magnitude":0.2,"text":"There were punters drafted before tom brady! ","comment_score":27}
{"sentiment_score":0.1,"magnitude":0.1,"text":"[but Brady is better at goat pics](https://classic17.files.wordpress.com/2010/08/tom-brady-goat.jpg)","comment_score":154}
{"sentiment_score":0.5,"magnitude":0.5,"text":"everyone knows brady's great, it's okay dude","comment_score":11}
{"sentiment_score":-0.1,"magnitude":0.1,"text":"There seems to be one throw brady does every few games where he just throws it up to a receiver in a full \"rex grossman \" mode. ","comment_score":18}
{"sentiment_score":0.2,"magnitude":0.2,"text":"brady's been in the league 18 years.","comment_score":66}
{"sentiment_score":-0.7,"magnitude":0.7,"text":"Yeah in the mid 2000s brady and half the team was listed as questionable every game.","comment_score":20}
{"sentiment_score":0.2,"magnitude":0.2,"text":"[Summertime transportation](http://www.sportspickle.com/wp-content/uploads/2013/10/tom-brady-unicorn-brady-wussy.jpg)","comment_score":17}
{"sentiment_score":0.1,"magnitude":0.1,"text":"Mechabrady will be around for another millennia ","comment_score":17}
{"sentiment_score":0.8,"magnitude":0.8,"text":"Yeah Imma need Shaq Mason helping brady with the brace","comment_score":20}
{"sentiment_score":0.2,"magnitude":0.2,"text":"/r/falcons2 is gonna explode when brady or rodgers wins ","comment_score":23}
{"sentiment_score":-0.6,"magnitude":0.6,"text":"Listen to me you crustacean mother fucker, you best go out there and fucking slaughter the pats, for the entire AFC, retire brady.","comment_score":13}
{"sentiment_score":0,"magnitude":1.4,"text":"Increases injury frequency, sets Tom bradys injury and toughness low.  Proceeds to hit stick him until injured.  Quit game after injury and reload.  ","comment_score":41}
{"sentiment_score":-0.1,"magnitude":1.1,"text":"I disagree. I think that bledsoe could have maintained at least as well as brady did those early years. People forget that Bledsoe was a top 10 qb at worst.","comment_score":13}
{"sentiment_score":0.2,"magnitude":0.2,"text":"I prefer a scenario where we question who is better, johnny or brady.","comment_score":45}
{"sentiment_score":-0.4,"magnitude":0.8,"text":"Yeah, what was the logic behind that? I feel like Belichick putting brady as \"Probable: shoulder\" for 8 years maybe contributed to it going away. ","comment_score":11}
{"sentiment_score":0,"magnitude":0,"text":"[You're goddamn right](http://www.totalprosports.com/wp-content/uploads/2013/12/16-tom-brady-stupid-hair.jpg)","comment_score":38}
{"sentiment_score":-0.6,"magnitude":0.6,"text":"God brady runs so awkwardly","comment_score":70}
{"sentiment_score":0,"magnitude":1,"text":"Run where exactly? To the place where to broncos were plowing over the guards.  Or the right side? Where miller was running down a 5.89 brady? Where could he run?","comment_score":64}
{"sentiment_score":-0.1,"magnitude":0.8,"text":"brady, manning, montana, young, elway, brees, unitas, graham marino, farve, stabauch.\n\nedit: MISTAKE MISTAKE MISTAKE MONTANNA IS DEF TOP 10\n","comment_score":11}
{"sentiment_score":0.2,"magnitude":0.5,"text":"14-2 season with brady out for the first 4 games\n\nyeah I don't think anyone called that (maybe the jimmy G train gif)","comment_score":17}
{"sentiment_score":-0.1,"magnitude":0.8,"text":"You can say that about most players, really. Guys with a tom brady playoff sample size arent tremendously common\n\nThats why im not a huge fan of using playoff stats to make a for or against for a player...the sample size often isn't there to indicate an obvious trend ","comment_score":148}
{"sentiment_score":0.6,"magnitude":0.6,"text":"but brady is a systems qb so itll work well","comment_score":21}
{"sentiment_score":0.3,"magnitude":0.3,"text":"Yeah, but you'd have tom brady as qb","comment_score":15}
{"sentiment_score":0.4,"magnitude":0.4,"text":"roger goodell is generally aware tom brady will win the super bowl.","comment_score":16}
{"sentiment_score":-0.4,"magnitude":0.4,"text":"tom brady suspended 4 games","comment_score":23}
{"sentiment_score":-0.7,"magnitude":0.7,"text":"More overblown than suspending brady for 4 games because of a rule he didn't even break?","comment_score":294}
{"sentiment_score":-0.1,"magnitude":0.1,"text":"If someone hit ton brady like that theyd be suspended for life ","comment_score":28}
{"sentiment_score":0.5,"magnitude":0.5,"text":"Seeing a fresh team win the super bowl would be more interesting than bradys 5th ring","comment_score":43}
{"sentiment_score":0.1,"magnitude":0.4,"text":"I saw someone say that brady should tell goodell that \"It feels a little light\" when handed the trophy. I would die of happiness","comment_score":11}
{"sentiment_score":-0.8,"magnitude":0.8,"text":"I don't trust the media to cover it, too many in the media still say brady cheated even though the evidence and the nfl's report says the opposite.","comment_score":12}
{"sentiment_score":0.4,"magnitude":0.4,"text":"&gt;Rodgers has way more talent, brady has the better ~~resume~~ career","comment_score":15}
{"sentiment_score":0,"magnitude":0,"text":"Suspend brady for the next 4 games, you say? ","comment_score":265}
{"sentiment_score":0.1,"magnitude":0.1,"text":"Playing soft zone against the pats possession WR's and brady is asking you lose. ","comment_score":154}
{"sentiment_score":0.6,"magnitude":0.6,"text":"pats fans are collectively just a proud momma looking out for our baby boy brady ","comment_score":60}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"you're getting downvoted because you're trying to sneak ride brady's nuts for taking less than market value for his services.","comment_score":27}
{"sentiment_score":-0.2,"magnitude":0.5,"text":"We areone of the more disliked teamd though.  Good bye first round pick and sorry about brady's upcoming suspension","comment_score":15}
{"sentiment_score":-0.1,"magnitude":0.7,"text":"The NFL has [stated](https://www.google.com/amp/www.cbssports.com/nfl/news/report-patriots-pay-a-brady-owned-company-run-by-suspect-partner/amp/?client=safari) that they're aware of the arrangement and have taken no action. So given the league's typical enthusiasm for disciplining the Pats this is probably a non-story. ","comment_score":200}
{"sentiment_score":0,"magnitude":0,"text":"[You think this is a game?](https://nesncom.files.wordpress.com/2015/03/tom-brady-peyton-manning-face-mashup.jpg?w=640&amp;h=362)","comment_score":40}
{"sentiment_score":0.2,"magnitude":0.4,"text":"Peyton all the way.\n\nBrady is [wooden](http://www.nbc.com/saturday-night-live/video/tom-brady-monologue/n11951?snl=1), and [Peyton](https://www.youtube.com/watch?v=cSuHQZjzJYY) has natural [screen presence.](https://www.youtube.com/watch?v=YGmX6m78zDM)\n\n","comment_score":33}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"Uhhhh brady gets shit for it every game thread","comment_score":12}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"Tom brady is exempt because he is why skill players go to new England and have their careers turned around.","comment_score":12}
{"sentiment_score":0.1,"magnitude":0.3,"text":"One side-effect of Deflategate was that a number of Brady's personal emails were released, including a pretty funny exchange over a pool cover.\nhttp://www.sbnation.com/lookit/2015/8/6/9107891/tom-brady-do-not-buy-a-pool-in-new-england","comment_score":15}
{"sentiment_score":0.1,"magnitude":0.4,"text":"Don't hate, just appreciate. Him and brady are once in a generation, maybe even once in a lifetime qbs. I dont think anyone in the league currently will reach as high as either of them ","comment_score":14}
{"sentiment_score":0,"magnitude":0.6,"text":"lets hope that by the time you have a child \nA) tom brady isn't retired\nB) bill bilichick isn't dead.\n\nsince you are a redditor,  it looks grimm. you are better off moving to a city like oakland. derek carr is still young!","comment_score":209}
{"sentiment_score":-0.1,"magnitude":0.9,"text":"http://www.sbnation.com/2014/1/9/5276868/breaking-madden-tom-brady\n\n&gt;I made 21 identical copies of Tom Brady, complete with his height, weight, and exact skill ratings in every category. Then I released every member of the Patriots' offense not named Tom Brady, and replaced them with Tom Brady. He'll be throwing to himself, handing off to himself, and blocking for himself.\n\n","comment_score":28}
{"sentiment_score":0.1,"magnitude":0.2,"text":"Yeah, if I was more interested I would do wins/games played for all 4 of them (plus manning, so 5), but that feels like a lot of work and I'm feeling pretty lazy. \n\nsuspensions and injuries def suppressed a few of their numbers, but i'll bet wins/games played puts brady at #1 and manning at #2","comment_score":16}
{"sentiment_score":-0.1,"magnitude":3.4,"text":"&gt; Dolphins getting worse\n\nJust made the playoffs for the first time, Tannehill looks legitimately like a franchise QB, young offensive and defensive players.\n\n&gt; brady nearing the end\n\nThe Patriots with Kraft as an owner are going to be like the Steelers I believe, always above average at worst.\n\n\n&gt; Easy decision.\n\nNY State Income Taxes vs. Florida State Income Taxes...","comment_score":12}
{"sentiment_score":0,"magnitude":2.1,"text":"i think its hilarious u kids talking shit about brady. u wouldnt say this shit to him at lan, hes jacked. not only that but he wears the freshest clothes, eats at the chillest restaurants and hangs out with the hottest dudes. yall are pathetic lol","comment_score":79}
{"sentiment_score":0.2,"magnitude":0.6,"text":"I'm 32 and I was born in Foxboro, I have followed them my whole life.  I had a pen-pal in green bay when I was in 6th grade for the 96 superbowl, and I cried when they lost. I misspoke, I meant all of the brady-era Patriots superbowls.  ","comment_score":11}
{"sentiment_score":0.2,"magnitude":0.2,"text":"A lot of Bills fans say he needs too much work and we need a better \"franchise QB\",Like we have a clone of 30 year old Tom brady in the back office ready to be trotted out. ","comment_score":13}
{"sentiment_score":-0.4,"magnitude":1.8,"text":"Not really. And that's insanely misleading. You have to count the bonus for goodness sake. Why didn't you just say tom brady, 2016, he only made $1 million!!! ","comment_score":25}
{"sentiment_score":0.1,"magnitude":0.8,"text":"homie have you even watched football the last 10 years?\n\n&gt;[Throws](https://gfycat.com/OrderlyNegativeFluke)\n\n\n&gt;[short](http://stream1.gifsoup.com/view/1058496/brady-to-moss-65yd-td-o.gif)\n\n&gt;[relies](http://s3.amazonaws.com/br-cdn/temp_images/2013/11/03/2013-11-0314_26_39.gif)\n\n\n&gt;[on YAC](http://2.bp.blogspot.com/-rZmIWd806yY/UnbsnfpBh3I/AAAAAAAADQo/MRcZZQV_r8g/s1600/btoa.gif)\n\nlmao @ you\n\n","comment_score":17}
{"sentiment_score":-0.4,"magnitude":0.8,"text":"No one thinks goodell hates brady. We just think that goodell bent to the will of the other owners of the league and went after brady/the patriots for a scandal that would have been a non story for any other team in the league, and dragged brady's name through the mud in the process. ","comment_score":448}
{"sentiment_score":0,"magnitude":1.5,"text":"&gt; Increases injury frequency, sets Tom bradys injury and toughness low. Proceeds to hit stick him until injured. Quit game after injury, busts a nut, and reload.\n\nFTFY","comment_score":16}
{"sentiment_score":0.5,"magnitude":3,"text":"I read a webMD (I know, odd) article about Brady's diet, and the nutritionist they talked to said, yes, Brady is going overboard for the no nightshade vegetables and stuff like that, but he isn't doing anything to harm his body and that the diet is overall really good for him.\n\nThe thing I'm most impressed with was actually his sleep schedule. What grown man, let alone one with disposable income goes to bed as early as Brady? His sole focus is to continue to play as long as he possibly can, its quite remarkable. \n\nEdit: Found the article [here](http://www.webmd.com/diet/news/20160115/tom-brady-gisele-bundchen-diet#1)","comment_score":13}
{"sentiment_score":0.2,"magnitude":0.2,"text":"[Here you go](https://www.reddit.com/r/nfl/comments/5fcnvd/belichick_on_bradys_historic_200th_win_hes_won_a/daj74wr)","comment_score":98}
{"sentiment_score":0.3,"magnitude":0.7,"text":"Nobody is sleeping on Ryan at this point lol. He's got a passer rating 5 points higher than brady.","comment_score":17}
{"sentiment_score":0,"magnitude":0.2,"text":"cris collinsworth already said his vote went to brady.  so probably not","comment_score":343}
{"sentiment_score":0,"magnitude":0.1,"text":"Plus, it'd be a rematch of superbowl 31, 20 years later.\n\nAlso, about a few more years of brady, I'm gonna bawl my fucking eyes out when he retires.","comment_score":11}
{"sentiment_score":-0.1,"magnitude":0.9,"text":"Same here, I don't hate brady, I respect anyone who does their job as well and for as long as he has.\n\nGoodell on the other hand? He deserves to be embarrassed.","comment_score":13}
{"sentiment_score":0,"magnitude":1.1,"text":"the amount of people taking the steelers all week was hilarious. the amount of puffing of aaron rodger's ive listened to and his \"run the table\" nonsense when brady was straight up the better QB in his 12 starts...... how brady and the boys somehow flew under the radar the past couple weeks is beyond me.\n\nback in the bowl. keep doubting. ","comment_score":131}
{"sentiment_score":-0.8,"magnitude":0.8,"text":"cut to barry sanders as a football, the camera zooms out to see him/the football being thrown to wide receiver in the end zone, and gets spiked, he then says this must be what tom brady mustve felt he juked out brian urlacher   ","comment_score":11}
{"sentiment_score":0.2,"magnitude":1.1,"text":"I just wanna see the chiefs and pats. I wanna see that pass rush vs brady dotting them up. Then the chess match of Tyreek and Bill trying to take him out of the equation. Would be fun","comment_score":14}
{"sentiment_score":-0.2,"magnitude":0.8,"text":"brady had 2 tipped ints and was under pressure the entire game and Lewis gave them free points with that kickoff fumble.  No team left in the playoffs is capable of applying that kind of pressure.  That Chiefs D is not at the same level.","comment_score":26}
{"sentiment_score":-0.2,"magnitude":0.8,"text":"Pass rush isn't important when he throws the ball in less than 2 seconds. You need good coverage to stop brady. Again, it would not be close.","comment_score":13}
{"sentiment_score":0.1,"magnitude":0.2,"text":"So brady wins a whole lot more than other all time great QBs when his team can't run the ball or he's in a come from behind/shootout.\n\nGotcha.","comment_score":13}
{"sentiment_score":0.2,"magnitude":0.4,"text":"Blount had 11 TDS from the 1 yard line alone. Imagine if brady had thrown 5-6 more tds in those spots, he'd be mvp for sure ","comment_score":94}
{"sentiment_score":-0.3,"magnitude":0.6,"text":"The first play when they were still in the end zone, brady baited them into encroachment, therefore getting out of the end zone, can't be mad at Seattle for BBs plan going right. When brady knelt, and they knew he would knelt, they lashed out like the children they are despite having no chance of winning.","comment_score":35}
{"sentiment_score":-0.1,"magnitude":0.5,"text":"i don't see how that's possible for brady. manning threw 55 tds at 37 and was out of the league by 39. i get that injuries contributed to his noodle arm, but it seems like in sports age can catch up with you very suddenly and drastically. ","comment_score":15}
{"sentiment_score":0,"magnitude":1,"text":"Farve and elway if you ignore the consistency thing. I think they both had even better cannons, but more prone to mistakes. Its like you took 90% of farve and fused it with 90% of brady. I dont think hes as consistent as brady but hes got a ton more talent and hes obvious way more reliable than farve","comment_score":18}
{"sentiment_score":-0.3,"magnitude":0.7,"text":"I have no personal hatred for gb or aaron but if gb beats ne in the sb, the whole media network is going to talk about aaron rodgers for so long its going to be annoying as fuck. Not to mention bullshit opinions of tom brady being a system qb and that anyone can do what tom does under belichick is going to be stronger than ever.","comment_score":17}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"Texans taking the game plan of, \"keep brady off the field,\" too seriously...","comment_score":328}
{"sentiment_score":0.1,"magnitude":1.5,"text":"A big name means nothing if he doesn't produce more.\n\n\nhttps://www.reddit.com/r/nfl/comments/43lbgk/manningbrady_the_supporting_casts_a_statistical/\n\n&gt;Manning average: 14.5 Stdev: 7.5\n\n&gt;Brady average: 10.3 Stdev: 6.9\n\n&gt;Overall, Brady has had the better end of the deal in terms of rushing attacks. This one takes the opposite trend from Defense - whereas Manning had better rushers early on, Brady has had better rushers since 2007.\n\n&gt;Brady also had only three below-average rushing attacks, whereas Manning has had to deal with 7.\n\nAnd Brady's OL was better, so there is that. ","comment_score":27}
{"sentiment_score":0.2,"magnitude":1.4,"text":"###[Tom Brady lobs a pass deep to Chris Hogan for 45 yards](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_500k.mp4)\n\n^Play ^data: ^Q2 ^07:37, ^3rd ^and ^10, ^ball ^on ^NE ^18, ^\\(Shotgun) ^T.Brady ^pass ^deep ^middle ^to ^C.Hogan ^to ^HOU ^37 ^for ^45 ^yards ^\\(C.Moore).","comment_score":18}
{"sentiment_score":0.1,"magnitude":1.1,"text":"###[Tom Brady throws laser to Julian Edelman for first down](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_500k.mp4)\n\n^Play ^data: ^Q1 ^11:47, ^3rd ^and ^3, ^ball ^on ^NE ^42, ^\\(Shotgun) ^T.Brady ^pass ^short ^middle ^to ^J.Edelman ^to ^MIA ^38 ^for ^20 ^yards ^\\(S.Paysinger).","comment_score":20}
{"sentiment_score":0,"magnitude":3,"text":"Headcoach, injuries, talent around you. Gb doesn't really pick up players outside of the draft. Take your pick?\n\nMaybe brady or manning have slightly better decision making but it's not that much better than rodgers. Rodgers has em both athletically and the accuracy...so many of his throws are just perfect. I'm not saying brady or manning are shit compared to him. Just no question to me that he's the best QB I'll likely ever watch play.","comment_score":14}
{"sentiment_score":0,"magnitude":3,"text":"You have guys with ability playing hard for a good coach who sets them up for success.\n\nSaying they wouldn't make a roster is a bit much.  Yeah some of them were fringe guys, but that's because other coaches didn't know how to use their talents.  \n\nHogan can run the same routes for any other QB.  75% of the QBs can hit someone like him when he gets open.\n\nEdelman and Brady just have amazing chemistry, but without brady Edelman would still be a great special teamer if he didn't break into the receiving corps for someone else.\n\nThe patriots aren't magic, they just know how to use a guy's full potential. \n\nI don't know where I was going with that but F keyshawn and his dumb ass","comment_score":23}
{"sentiment_score":0,"magnitude":0.8,"text":"###[Jadeveon Clowney lowers boom on Tom Brady, forces incompletion](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_500k.mp4)\n\n^Play ^data: ^Q2 ^03:14, ^2nd ^and ^9, ^ball ^on ^NE ^34, ^\\(Shotgun) ^T.Brady ^pass ^incomplete ^short ^left ^to ^D.Lewis ^[J.Clowney].","comment_score":55}
{"sentiment_score":0,"magnitude":1.2,"text":"I swear back when the NFL was doing the breast cancer awareness campaign this season Brady mentioned a family member had cancer. \n\nI believe I heard it on one of the local news stations here in Boston. However, I can't find any news stories to confirm.\n\n**Edit** Someone posted a Tom Curran report about Brady's mom having health issues.\n\nhttps://www.reddit.com/r/nfl/comments/5rbcte/bradys_mother_illness_was_a_weight_for_him_to/","comment_score":79}
{"sentiment_score":0,"magnitude":1.2,"text":" i think its definitely for superficial reasons that they have the images that they do. brady's facial expressions look more petulant, while manning looks mature naturally and remains a class act off the field (he has those skeletons in his closet, but has been clean for pretty much his whole career). \n\ni should also mention that brady doesn't look built. he's similar to curry in that regard","comment_score":14}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"did you see that block brady threw?","comment_score":32}
{"sentiment_score":0.2,"magnitude":1.8,"text":"You only hate his dad *now*?\n\nhttp://www.espn.com/blog/nflnation/post/_/id/53216/tom-brady-takes-shot-at-buffalo\n\n&gt;\"Even when I started my pro career, he traveled to Buffalo,\" Brady said of his father. \"I don't know if you guys have ever been to the hotels in Buffalo — they're not the nicest places in the world — but he would still travel to those [games]. It was just great to grow up in a house like that and feel so supported by your mom and dad.\"","comment_score":49}
{"sentiment_score":0,"magnitude":0,"text":"Looks better in this one from the 2014 AFCCG\nhttps://www.google.com/amp/www.sbnation.com/platform/amp/lookit/2015/1/18/7790827/tom-brady-juke-patriots-colts-afc-championship","comment_score":16}
{"sentiment_score":-0.5,"magnitude":1.7,"text":"Goodell headed a witch hunt against brady by accusing him of playing with under inflated footballs in a playoff game against the Ravens in the 2014 season, which he argued gave him an advantage and compromised the integrity of the game. This was found to be bullshit and it was ruled that brady should not be punished, but Goodell suspended brady for the first four games of this season anyway. (Someone please correct me if I missed anything)\n","comment_score":14}
{"sentiment_score":0.4,"magnitude":0.4,"text":"peak brady was like 2007 to now lol","comment_score":12}
{"sentiment_score":0.1,"magnitude":0.1,"text":"But brady didn't ","comment_score":17}
{"sentiment_score":-0.3,"magnitude":0.6,"text":"The patriots actually start slow in the super bowl more so than all the teams they have gone up against. They have 0 points in the first quarter in all of their SBs (with brady/BB)","comment_score":11}
{"sentiment_score":0.1,"magnitude":0.1,"text":"He won the same amount of games as brady this year","comment_score":31}
{"sentiment_score":0,"magnitude":0,"text":"Everyone's heard of angry brady, but let me tell **you** about dirty sanchez.","comment_score":19}
{"sentiment_score":0.4,"magnitude":0.8,"text":"damn i'm surprised brady gets emotional about making the superbowl for some reason. Prob bc as fans its a forgone conclusion he'll get there but it prob is amazing and huge for brady the player","comment_score":19}
{"sentiment_score":0,"magnitude":1.3,"text":"I feel like this isn't as much the case anymore. You have to get pressure with 4 while ALSO playing great man coverage, which is harder said than done. If you hit him a bunch of times, but your secondary isn't playing complimentary to that, brady will still do damage (especially in recent years where he doesn't see ghosts as much as he used to). It's teams like the texans and the broncos that have both strong secondaries *and* pass rushes that disrupted brady the most this season. Even the seahawks to an extent. ","comment_score":53}
{"sentiment_score":-0.8,"magnitude":0.8,"text":"in bradys worst performance of the year the team managed to post the most points allowed by the number 1 defense in the league ","comment_score":29}
{"sentiment_score":-0.1,"magnitude":1.8,"text":"explain to me what 2013 and 2006 were. those teams sucked. those offenses were just so bad outside brady. brady clawed both into the AFCCG.  kenbrell thompkins, dobson, edelman before he was known, reche caldwell, elderly troy brown, doug fucking gabriel, bam childress.... like who were those people","comment_score":32}
{"sentiment_score":0.1,"magnitude":0.1,"text":"https://espnfivethirtyeight.files.wordpress.com/2015/02/paine-datalab-brady-table-1.png?quality=90&amp;strip=all&amp;w=575&amp;ssl=1","comment_score":42}
{"sentiment_score":0.5,"magnitude":1,"text":"Pretty well documented that he does.\n\nhttp://www.businessinsider.com/tom-brady-sleep-2014-11","comment_score":1084}
{"sentiment_score":0.4,"magnitude":1.8,"text":"in 10 years,  stafford will still be younger than brady is NOW, let alone 2 more years.\n\nstafford has been the fastest to 10k yards, 15k yards, 20k yards, etc.   That probably continues.  As long as he stays healthy.","comment_score":52}
{"sentiment_score":0.1,"magnitude":0.1,"text":"brady missed the first 4 games lmao","comment_score":15}
{"sentiment_score":0.1,"magnitude":0.1,"text":"Rodgers has way more talent, brady has the better resume","comment_score":35}
{"sentiment_score":-0.2,"magnitude":0.8,"text":"The refs ruled that brady was down with the ball, Jesus christ people, learn the rules. Yes, the D stole the fucking ball in the pile from brady, doesn't make a difference. ","comment_score":19}
{"sentiment_score":0.1,"magnitude":0.5,"text":"https://www.reddit.com/r/nfl/comments/43lbgk/manningbrady_the_supporting_casts_a_statistical/\n\nBrady had a better defense according to DVOA. In fact, Brady had a better everything according to DVOA. \n","comment_score":22}
{"sentiment_score":-0.5,"magnitude":1,"text":"I dunno, multiple turnovers and multiple hits on brady is pretty damn hard to do.  Their deep D isn't great, but it's nothing to scoff at.","comment_score":11}
{"sentiment_score":0.1,"magnitude":0.5,"text":"Real talk can they pull brady already? Last thing i want is Jimmy Gullah Gullah Island  starting in the super bowl","comment_score":17}
{"sentiment_score":0.4,"magnitude":0.8,"text":"[So this again](http://www.ultimatecapper.com/wp-content/uploads/2017/01/tom-brady-2.jpg). I like it.","comment_score":46}
{"sentiment_score":0.2,"magnitude":0.2,"text":"3-1 without brady","comment_score":16}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"did you see that block brady threw?","comment_score":32}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"did you know that this isnt brady's first superbowl?","comment_score":297}
{"sentiment_score":0.7,"magnitude":0.7,"text":"it also involves tom brady. say what you want, but his name alone brings out all the haters in the world, as well as the staunch homers. ","comment_score":64}
{"sentiment_score":0.1,"magnitude":0.1,"text":"pls papa brady kill the birds","comment_score":20}
{"sentiment_score":-0.1,"magnitude":0.1,"text":"the only reason brady did it is because his endorsements and wife make way more money than he could ever make in the nfl","comment_score":96}
{"sentiment_score":0.5,"magnitude":1,"text":"Pretty well documented that he does.\n\nhttp://www.businessinsider.com/tom-brady-sleep-2014-11","comment_score":1084}
{"sentiment_score":0,"magnitude":0,"text":"[You think this is a game?](https://nesncom.files.wordpress.com/2015/03/tom-brady-peyton-manning-face-mashup.jpg?w=640&amp;h=362)","comment_score":40}
{"sentiment_score":0.2,"magnitude":0.2,"text":"If you liked that, you might like the fact that Tom Brady was listed on the injury report for [three consecutive years](http://archive.boston.com/sports/articles/2008/09/06/bradys_three_year_streak_on_injury_report_comes_to_an_end/), yet never missed a game.","comment_score":110}
{"sentiment_score":0.5,"magnitude":0.5,"text":"brady's also deep enough in his career to care more about winning games than $$$","comment_score":63}
{"sentiment_score":0.1,"magnitude":0.5,"text":"https://www.reddit.com/r/nfl/comments/43lbgk/manningbrady_the_supporting_casts_a_statistical/\n\nBrady had a better defense according to DVOA. In fact, Brady had a better everything according to DVOA. \n","comment_score":22}
{"sentiment_score":0.3,"magnitude":0.7,"text":"Nobody is sleeping on Ryan at this point lol. He's got a passer rating 5 points higher than brady.","comment_score":17}
{"sentiment_score":0.4,"magnitude":0.9,"text":"Not only that but he is kind of the anti-brady in that Brady is meticulous about everything he puts in his body.\n\nEli would have no issue with a steak topped with ice cream.","comment_score":216}
{"sentiment_score":-0.1,"magnitude":0.6,"text":"Most ridiculous part of that is that the offense scored enough points to win. The defense let brady do whatever he wanted and blew the game. The defense plays better, they dont need a last second TD","comment_score":14}
{"sentiment_score":-0.3,"magnitude":0.8,"text":"Just wait. The day will come when brady and BB are no longer there and your entire fanbase will shrink, people will brag about a era that no longer exists and the entire NFL world will feel no sympathy.","comment_score":44}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"we win every turnover battle because brady's throws like 0 ints.","comment_score":16}
{"sentiment_score":0.4,"magnitude":1.2,"text":"I believe [this](http://grantland.com/features/how-terminology-erhardt-perkins-system-helped-maintain-dominance-tom-brady-patriots/) is what you are thinking of, but that's the system the Pats use. It's running the same routes out of multiple formations.\n\nHere's the [relevant article on the Colts](http://grantland.com/features/how-return-simplicity-peyton-manning-indy-offense-ignited-denver-broncos/), which is pure simplicity - few plays, few formations, all execution.","comment_score":14}
{"sentiment_score":0.1,"magnitude":1.5,"text":"*please dont look at my post history*\n\nBut seriously I think a lot of pats fans are happy for matty ice since BC is the only real big time college football program that New England has. I think the \"my GOAT\" talk is mostly in jest, but also fans being pissed off at the league in general for the 4 game suspension. I think you will see a lot of people refocus on the real goal: To get a 5th ring for brady","comment_score":24}
{"sentiment_score":0.2,"magnitude":0.2,"text":"[Summertime transportation](http://www.sportspickle.com/wp-content/uploads/2013/10/tom-brady-unicorn-brady-wussy.jpg)","comment_score":17}
{"sentiment_score":0,"magnitude":0.6,"text":"Really? This is the first ive ever heard of the patriots with brady constantly appearing in conference championships. ","comment_score":113}
{"sentiment_score":0.1,"magnitude":0.1,"text":"But brady didn't ","comment_score":17}
{"sentiment_score":0,"magnitude":0,"text":"Everyone's heard of angry brady, but let me tell **you** about dirty sanchez.","comment_score":19}
{"sentiment_score":0.4,"magnitude":0.8,"text":"[So this again](http://www.ultimatecapper.com/wp-content/uploads/2017/01/tom-brady-2.jpg). I like it.","comment_score":46}
{"sentiment_score":-0.1,"magnitude":0.1,"text":"If someone hit ton brady like that theyd be suspended for life ","comment_score":28}
{"sentiment_score":0,"magnitude":0.2,"text":"packers are trash without rodgers. Pats went 3-1 without brady. ","comment_score":14}
{"sentiment_score":0.4,"magnitude":0.4,"text":"peak brady was like 2007 to now lol","comment_score":12}
{"sentiment_score":-0.1,"magnitude":0.1,"text":"There seems to be one throw brady does every few games where he just throws it up to a receiver in a full \"rex grossman \" mode. ","comment_score":18}
{"sentiment_score":0.4,"magnitude":0.4,"text":"roger goodell is generally aware tom brady will win the super bowl.","comment_score":16}
{"sentiment_score":0.1,"magnitude":0.1,"text":"Rodgers has way more talent, brady has the better resume","comment_score":35}
{"sentiment_score":-0.8,"magnitude":0.8,"text":"in bradys worst performance of the year the team managed to post the most points allowed by the number 1 defense in the league ","comment_score":29}
{"sentiment_score":0.4,"magnitude":0.4,"text":"Mechabrady is never leaving us though ","comment_score":23}
{"sentiment_score":0.1,"magnitude":0.1,"text":"brady with the clutch block","comment_score":20}
{"sentiment_score":0,"magnitude":0,"text":"Besides brady you havent produced a franchise qb","comment_score":11}
{"sentiment_score":0.2,"magnitude":0.7,"text":"Also, apparently, the greatest beer chugger.\n\nhttps://www.youtube.com/watch?v=N3zKiW_wAO8\n\nhttp://sports.nbcsports.com/2017/01/23/new-title-for-new-england-patriots-tom-brady-best-beer-chugger/","comment_score":11}
{"sentiment_score":0.1,"magnitude":0.5,"text":"Real talk can they pull brady already? Last thing i want is Jimmy Gullah Gullah Island  starting in the super bowl","comment_score":17}
{"sentiment_score":0.4,"magnitude":0.4,"text":"i agree with you on the no-bitching part, but tom brady/the patriots are in no position to talk about refs.","comment_score":29}
{"sentiment_score":-0.1,"magnitude":1.6,"text":"This has been all but confirmed.  \n\nBoth [ESPN](http://www.espn.com/espn/otl/story/_/id/13533995/split-nfl-new-england-patriots-apart) and [SI](http://www.si.com/nfl/2015/09/08/patriots-cheating-suspicions-bill-belichick-tom-brady?xid=si_social) ran stories around the same time with multiple sources stating that the owners were angry that the Patriots were not punished more for SpyGate, and demanded harsh treatment on the ball deflation bullshit.  This certainly jibes with the fact that Troy Vincent said that [the whole matter would be wrapped up in a few days](https://www.bostonglobe.com/sports/2015/01/20/vincent/38YWpilDkAJXiQVqXReDuK/story.html), and it [ended up lasting longer](http://www.espn.com/nfl/story/_/id/15857262/nfl-500-days-later-deflategate-full-mystery-tom-brady-new-england-patriots) than [Joseph Gordon-Levitt's relationship with Summer](http://www.imdb.com/title/tt1022603/?ref_=nv_sr_1).  \n\nThere was also [a Bleacher Report article](http://bleacherreport.com/articles/2629481-the-patriots-are-not-on-the-clock-deflategate-fallout-looms-large-in-nfl-draft) where they polled team execs shortly after DeflateGate and they were all happy about the investigation, then polled them a year later and they all regretted it because they were suddenly worried about their own team being subjected to the whims of the league office's discipline.","comment_score":56}
{"sentiment_score":-0.2,"magnitude":3.1,"text":"Except phone records were granted to the investigators.\n\n\"As for what was on the phone, Brady says that they turned over \"detailed pages\" of phone records and all of the emails requested by the Wells investigators. They also went to the phone company to retrieve the relevant messages from his broken phone. The NFL acknowledged that last part in the 20-page statement explaining Goodell's decision, buried in a footnote on page 12.\n\nThe league declined to work with the phone company to retrieve the details of Brady's cell phone records because it was \"simply not practical.\" That line and Goodell's effort to make it sound like Brady's phone was deliberately destroyed prior to meeting with investigators doesn't instill much confidence in the the NFL's ad hoc approach to disciplining players.\"\n\n[Source](https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=/amp/www.sbnation.com/platform/amp/2015/7/29/9066253/tom-brady-cell-phone-deflategate-suspension-nfl-roger-goodell&amp;ved=0ahUKEwiH5MvAsurRAhXMlFQKHUrYBDcQFghWMAw&amp;usg=AFQjCNErDLFyeS7SGZ0H4EhmJ75RXQieag&amp;sig2=EkXDvoIcXWOUXhOf92-mxA)    ","comment_score":24}
{"sentiment_score":0.2,"magnitude":0.5,"text":"14-2 season with brady out for the first 4 games\n\nyeah I don't think anyone called that (maybe the jimmy G train gif)","comment_score":17}
{"sentiment_score":0.4,"magnitude":0.4,"text":"i agree with you on the no-bitching part, but tom brady/the patriots are in no position to talk about refs.","comment_score":29}
{"sentiment_score":-0.6,"magnitude":0.6,"text":"Listen to me you crustacean mother fucker, you best go out there and fucking slaughter the pats, for the entire AFC, retire brady.","comment_score":13}
{"sentiment_score":0.1,"magnitude":0.4,"text":"I saw someone say that brady should tell goodell that \"It feels a little light\" when handed the trophy. I would die of happiness","comment_score":11}
{"sentiment_score":0,"magnitude":1.2,"text":"brady sucks.  Cut him.  Trade for osweiler","comment_score":13}
{"sentiment_score":0,"magnitude":1.2,"text":" i think its definitely for superficial reasons that they have the images that they do. brady's facial expressions look more petulant, while manning looks mature naturally and remains a class act off the field (he has those skeletons in his closet, but has been clean for pretty much his whole career). \n\ni should also mention that brady doesn't look built. he's similar to curry in that regard","comment_score":14}
{"sentiment_score":0.7,"magnitude":0.7,"text":"its works great against brady...do it all the time","comment_score":13}
{"sentiment_score":0.1,"magnitude":0.1,"text":"Mechabrady will be around for another millennia ","comment_score":17}
{"sentiment_score":0,"magnitude":0.3,"text":"Its pretty crazy how many great QBs this passing era has produced, when I think about it Ryan wouldn't even have been in my top 5 a year or two ago cause he has to play in a league that had Peyton, brady, Brees, Rodgers, and Big Ben. 2013 was a off year for him to (26-17 td int)","comment_score":13}
{"sentiment_score":0.2,"magnitude":1.8,"text":"that's true but a good quarterback can elevate those around them, especially at the skill positions.\n\nlook at Manning or Brady and their receivers/tight ends/runningbacks after they left Manning or brady.\n\nStats are an imperfect way to compare QBs, but its the best way we have","comment_score":15}
{"sentiment_score":0,"magnitude":1.2,"text":"when tom brady came back from 10 points down against the legion of boom in 2014. watching him carve up the seahakws on those long drives was a thing of beauty. that's when I realized that a *shot* at a franchise QB was worth any cost. you can't win a title without that piece.","comment_score":32}
{"sentiment_score":-0.2,"magnitude":0.6,"text":"I mean, this chart is really all you need to know: http://www.businessinsider.com/peyton-manning-tom-brady-salaries-2014-10.\n\nEven if you don't start till after 2003 when both Peyton and Brady were off their rookie contracts, Brady has left ~$50 million on the table.","comment_score":24}
{"sentiment_score":0,"magnitude":1.2,"text":"when tom brady came back from 10 points down against the legion of boom in 2014. watching him carve up the seahakws on those long drives was a thing of beauty. that's when I realized that a *shot* at a franchise QB was worth any cost. you can't win a title without that piece.","comment_score":32}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"half of brady's interceptions were thrown against seattle! ","comment_score":83}
{"sentiment_score":0.1,"magnitude":0.1,"text":"https://usatftw.files.wordpress.com/2013/11/bradyhighv.gif%3Fw%3D640%26h%3D360","comment_score":67}
{"sentiment_score":0.1,"magnitude":0.1,"text":"https://espnfivethirtyeight.files.wordpress.com/2015/02/paine-datalab-brady-table-1.png?quality=90&amp;strip=all&amp;w=575&amp;ssl=1","comment_score":42}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"How many of thisw fifty are drom brady and bill? ","comment_score":75}
{"sentiment_score":0,"magnitude":1.5,"text":"This.  I picture a lot of the SB 49 offense where seattle never touched brady because of the short, quick passing game.  That combined with some sort of 6 or 7 offensive lineman look where Blount just grinds them to death could really keep Ryan on the sideline.\n\nI hate to say it, but I just don't see the Pats losing \n\nEdit:  typo","comment_score":46}
{"sentiment_score":0.3,"magnitude":2.5,"text":"###[Tom Brady fits perfect pass to James White for 19-yard TD](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_500k.mp4)\n\n^Play ^data: ^Q3 ^09:14, ^3rd ^and ^3, ^ball ^on ^HOU ^19, ^\\(Shotgun) ^T.Brady ^pass ^deep ^right ^to ^J.White ^for ^19 ^yards, ^TOUCHDOWN. ^NE ^12-Brady ^18th ^career ^postseason ^game ^with ^2 ^pass ^TD, ^extends ^his ^NFL ^record ^\\(Favre, ^15).","comment_score":26}
{"sentiment_score":-0.1,"magnitude":1,"text":"Read about brady's work outs in college.  He would run stairs at 6am everyday by himself and again with the team at practice.  He certainly wasn't slacking.","comment_score":21}
{"sentiment_score":-0.1,"magnitude":2.1,"text":"Terry Bradshaw 4-0\n\nDan Marino Lost 0-1\n\nJim Kelly Lost 0-4\n\nSteve McNair Lost 0-1\n\n[full list from 2015](http://www.syracuse.com/superbowl/index.ssf/2015/01/list_quarterback_most_super_bowl_wins_2015_tom_brady_montana_bradshaw.html)\n\nI don't see correlation. \n\nEdit: Had list from 2005, it was from 2015","comment_score":52}
{"sentiment_score":0.2,"magnitude":0.4,"text":"Blount had 11 TDS from the 1 yard line alone. Imagine if brady had thrown 5-6 more tds in those spots, he'd be mvp for sure ","comment_score":94}
{"sentiment_score":-0.4,"magnitude":0.8,"text":"Yeah, what was the logic behind that? I feel like Belichick putting brady as \"Probable: shoulder\" for 8 years maybe contributed to it going away. ","comment_score":11}
{"sentiment_score":-0.2,"magnitude":0.6,"text":"I mean, this chart is really all you need to know: http://www.businessinsider.com/peyton-manning-tom-brady-salaries-2014-10.\n\nEven if you don't start till after 2003 when both Peyton and Brady were off their rookie contracts, Brady has left ~$50 million on the table.","comment_score":24}
{"sentiment_score":-0.1,"magnitude":0.2,"text":"Ben isn't really comprable to brady and peyton imo. There are way more young Ben's in the league than there are Brady/Peytons ","comment_score":43}
{"sentiment_score":0,"magnitude":0,"text":"ESPN has been on the \"sink brady\" train since Mort tweeted about footballs. ","comment_score":18}
{"sentiment_score":-0.1,"magnitude":0.7,"text":"rattled tom brady was when he used to get fancy feet in the pocket and drop to the ground when no one was around him. It peaked after his ACL injury","comment_score":11}
{"sentiment_score":0,"magnitude":0.2,"text":"tom brady needs a thumb ring.\n\ndont be selfish, gawd","comment_score":27}
{"sentiment_score":-0.1,"magnitude":1,"text":"Read about brady's work outs in college.  He would run stairs at 6am everyday by himself and again with the team at practice.  He certainly wasn't slacking.","comment_score":21}
{"sentiment_score":0.5,"magnitude":0.5,"text":"Seeing a fresh team win the super bowl would be more interesting than bradys 5th ring","comment_score":43}
{"sentiment_score":-0.1,"magnitude":2.6,"text":"[NFL Fines Von Miller For Illegal Tom Brady Hit But Just Half Regular Amount](http://nesn.com/2015/12/von-miller-fined-for-illegal-tom-brady-hit-but-only-half-regular-amount/)\n\n[Talib not fined for snatching Crabtree’s chain](http://profootballtalk.nbcsports.com/2017/01/06/talib-not-fined-for-snatching-crabtrees-chain/)\n\n[NFL rebukes Al Jazeera: ‘No credible evidence’ Peyton Manning used HGH](http://www.washingtontimes.com/news/2016/jul/25/nfl-rebukes-al-jazeera-peyton-manning-hgh-report/)\n\n[Broncos' Aqib Talib threatens Titans' Harry Douglas](http://www.delawareonline.com/videos/sports/nfl/2016/12/12/broncos'-aqib-talib-threatens-titans'-harry-douglas/95338124/)\n\n[NFL rescinds T.J. Ward's $9,115 fine for slamming Julian Edelman](http://broncoswire.usatoday.com/2017/01/18/denver-broncos-news-nfl-lifts-t-j-ward-fine-julian-edelman-hit/)\n\nThese are just events within the past year I can recall off the top of my head. I can't imagine why he feels Denver gets special treatment.","comment_score":12}
{"sentiment_score":-0.4,"magnitude":0.4,"text":"tom brady suspended 4 games","comment_score":23}
{"sentiment_score":-0.7,"magnitude":0.7,"text":"More overblown than suspending brady for 4 games because of a rule he didn't even break?","comment_score":294}
{"sentiment_score":-0.1,"magnitude":0.9,"text":"Alright, so if you take out the part where we went to 4 superbowls, and won 3 of them. And went 14-3 in the playoffs, we end up with the Patriots STILL going to more superbowls, and having a 9-6 record. So I guess if you only look at bradys least successful time, it's only slightly better than rodgers","comment_score":12}
{"sentiment_score":-0.5,"magnitude":0.5,"text":"but did u know that the last 100 superbowls the AFC qb was either manning brady or roethlisberger???????????","comment_score":16}
{"sentiment_score":0,"magnitude":1.5,"text":"This.  I picture a lot of the SB 49 offense where seattle never touched brady because of the short, quick passing game.  That combined with some sort of 6 or 7 offensive lineman look where Blount just grinds them to death could really keep Ryan on the sideline.\n\nI hate to say it, but I just don't see the Pats losing \n\nEdit:  typo","comment_score":46}
{"sentiment_score":0.2,"magnitude":0.2,"text":"brady's been in the league 18 years.","comment_score":66}
{"sentiment_score":0,"magnitude":0,"text":"steelers vs falcons\nor\nbrady vs eli manning superbowl rd 3","comment_score":15}
{"sentiment_score":-0.2,"magnitude":1,"text":"Brady, is better and will always be better. Mannings 55 td year was worse then bradys 50 td year, buthis 49 or something was better, but he also had 3 wrs that year with 1k+ yards, and a rb with 1500 yards. rushing. ","comment_score":14}
{"sentiment_score":-0.1,"magnitude":0.1,"text":"please list some playoff stats that montana has over brady?","comment_score":11}
{"sentiment_score":0.2,"magnitude":1.1,"text":"I just wanna see the chiefs and pats. I wanna see that pass rush vs brady dotting them up. Then the chess match of Tyreek and Bill trying to take him out of the equation. Would be fun","comment_score":14}
{"sentiment_score":0,"magnitude":1.4,"text":"Increases injury frequency, sets Tom bradys injury and toughness low.  Proceeds to hit stick him until injured.  Quit game after injury and reload.  ","comment_score":41}
{"sentiment_score":-0.2,"magnitude":1,"text":"Brady, is better and will always be better. Mannings 55 td year was worse then bradys 50 td year, buthis 49 or something was better, but he also had 3 wrs that year with 1k+ yards, and a rb with 1500 yards. rushing. ","comment_score":14}
{"sentiment_score":0.4,"magnitude":0.4,"text":"i know im in the minority, and would obviously love brady for 15 more years... but it would be a relatively smooth transition to jimmy G seeing as we're on the fence about trading him or keeping him.","comment_score":44}
{"sentiment_score":-0.4,"magnitude":0.8,"text":"yeah my point was about you saying how many comebacks brady and manning have. Those numbers don't mean anything and if someone just reads those numbers they wont have the full story ","comment_score":12}
{"sentiment_score":0,"magnitude":0.7,"text":"drew brees deserves all the recognition he receives, and more. dude is fucking legend, he just happened to play at the same time as a couple top 3 QBs ever when he's a mere easy top-10 guy. bit of a shame, but it's been a treat to watch manning, brady and brees the last ~15 years. ","comment_score":28}
{"sentiment_score":0,"magnitude":0,"text":"I also think tom brady masks a lot of belichick's personnel mistakes. ","comment_score":69}
{"sentiment_score":0.1,"magnitude":0.1,"text":"brady with the clutch block","comment_score":20}
{"sentiment_score":-0.2,"magnitude":1.9,"text":"they also realize that playing behind elite OL make life easier on you and when you're not the best of the best with an elite OL, how much worse you'll get if your OL is ever bad is a big 'what if'\n\nyou get hit more, rushed more and guys are less open for you, it forces you to move faster, think faster and be more precise. a .3 second mistake can be the difference in a TD and a sack\n\nit's easier to judge guys behind shitty OL than it is when they never get dirty\n\ngive winston, luck and wilson better OL and their mistakes probably come down, wilson and luck would be right there with brady and winston would be better off than he is now as the 3rd most hit QB in the NFL\n\nhell throw matt ryan in there too, he gets hit a lot and his OL isn't great\n\nbut if dak and mariota got hit 8 times per game like wilson, winston and luck, mariota probably wouldn't make it 8 games and dak throws more picks. i think dak would be better than mariota in that case because mariota led QBs in fumbles last year in only 12 games and was #1 in turnovers per game","comment_score":13}
{"sentiment_score":-0.1,"magnitude":1.8,"text":"explain to me what 2013 and 2006 were. those teams sucked. those offenses were just so bad outside brady. brady clawed both into the AFCCG.  kenbrell thompkins, dobson, edelman before he was known, reche caldwell, elderly troy brown, doug fucking gabriel, bam childress.... like who were those people","comment_score":32}
{"sentiment_score":0.1,"magnitude":0.1,"text":"some qb would be lucky enough to get a sniff of the playoffs and here's brady just doing his routine sb appearances","comment_score":221}
{"sentiment_score":-0.5,"magnitude":0.5,"text":"but did u know that the last 100 superbowls the AFC qb was either manning brady or roethlisberger???????????","comment_score":16}
{"sentiment_score":-0.4,"magnitude":0.4,"text":"Until he calls the same play 20 times in a row with a slight variation and brady gets tired of that shit. ","comment_score":35}
{"sentiment_score":-0.5,"magnitude":1.7,"text":"Goodell headed a witch hunt against brady by accusing him of playing with under inflated footballs in a playoff game against the Ravens in the 2014 season, which he argued gave him an advantage and compromised the integrity of the game. This was found to be bullshit and it was ruled that brady should not be punished, but Goodell suspended brady for the first four games of this season anyway. (Someone please correct me if I missed anything)\n","comment_score":14}
{"sentiment_score":0.2,"magnitude":0.2,"text":"If you liked that, you might like the fact that Tom Brady was listed on the injury report for [three consecutive years](http://archive.boston.com/sports/articles/2008/09/06/bradys_three_year_streak_on_injury_report_comes_to_an_end/), yet never missed a game.","comment_score":110}
{"sentiment_score":0,"magnitude":1.6,"text":"I hope they did. It was really bad. \n\nUrlacher should have made that play, that juke was better than you would've expected from brady but really...\n\nI think he just wanted to get a hit on the qb like most defensive players do and overcommitted to getting a little bit of hurt on Brady instead of slowing down and wrapping up","comment_score":15}
{"sentiment_score":0,"magnitude":0,"text":"brady's gonna bring the poison berries to midfield and demand that they both be named winners","comment_score":76}
{"sentiment_score":0,"magnitude":2.1,"text":"i think its hilarious u kids talking shit about brady. u wouldnt say this shit to him at lan, hes jacked. not only that but he wears the freshest clothes, eats at the chillest restaurants and hangs out with the hottest dudes. yall are pathetic lol","comment_score":79}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"Texans taking the game plan of, \"keep brady off the field,\" too seriously...","comment_score":328}
{"sentiment_score":0,"magnitude":3.1,"text":"Anyone who uses a 4 rings &gt;2 argument as a sole basis of arguing for brady or montana over manning is an idiot. That said, I think that looking post-season success is more than valid, considering that's the entire reason they play the game. 100% sure Manning and Brady would trade their 2013 and 2007 records for  winning the super bowl that year. Obviously no single post-season can be singled out, but I think that winning several SB, and consistently performing in the playoffs, is indicative that you got the job done, which is perhaps the most important thing you want for a qb. \n\nAlso, with regards to the other players, those sports also had a period of their league where there simply was no parity for several reasons (few teams, no salary cap etc.) There were only 8 teams in the league when Bill Russell won 11. Henri Richard won his 11 when there were only 6 teams in the league. No one argues that those guys are the GOAT because the league they played in is not comparable to the league that MJ or Gretzky played in. No one argues that Otto Graham is the GOAT either, despite the fact that he has 7 championships. He just played in such a different era that it's futile to make any comparisons.\n\nAlso Gretzky was just so far ahead of everyone else in terms of productivity. If Manning had stats that were so far ahead of everyone else (like double the number of TDs for example), then no one would argue who the GOAT was.\n\n ","comment_score":40}
{"sentiment_score":0,"magnitude":1.7,"text":"I think there is a major difference between teams running a Erhardt-Perkins offensive system and teams not running it. The differences in nomenclature reflect differences of how plays are conceptualized.\n\nThis article goes into more detail about it, in the context of the Patriots. Other teams besides them also use it however.\n\nhttp://grantland.com/features/how-terminology-erhardt-perkins-system-helped-maintain-dominance-tom-brady-patriots/","comment_score":19}
{"sentiment_score":0,"magnitude":0.2,"text":"about time big ben and brady got another playoff game. Despite both teams being dominate there has only been one game between them in the postseason.","comment_score":181}
{"sentiment_score":0,"magnitude":7.9,"text":"\"And brady breaks out of the pocket! He's at the 30!\n\n*... 25 seconds later*\n\nHe's at the 45 about to cross into green bay territory!\n\n*... 30 minutes pass by*\n\nOh my goodness brian urlacher has just ran onto the field out of the stands to exact his vengeance. [Oh my the elusive agile jungle cat Tom Brady has somehow evaded the great Urlacher](http://giant.gfycat.com/AcrobaticIckyGibbon.gif) It appears as though urlachers knees have exploded in the process may he RIP.\n\n*... It is now week 3 in the preseason for other teams in the NFL, they must continue despite no resolution to the super bowl yet*\n\nAND Brady is now separating himself, barreling downfield like the flow out of a tipped over syrup bottle!\n\n*21 years later, the Vikings just finished trading 2/3 of their state's territory for herschel walker III in the seasons running parallel to this yet to be resolved super bowl*\n\nAND Brady is at the 30! If he can score the patriots will win the- *at this moment joe buck dies of old age*\n\n*15 years later, the lions win their once every fifty years playoff game in the newly formed UXZFL^2 , the Minnesota Vikings get caught in an embarrassing intergalactic spaceship alien hooker sex party scandal*\n\nAND Brady is at the 10! COULD. HE. GO. ALL. THE. WAY. \n\nWait there is one man in pursuit! The newly acquired number 49! He won't make it in time he'll have to dive and go for the legs! OH AND #49 BERNARD POLLARD HAS STOPPED BRADY AT THE ONE YARD LINE NEARLY 40 YEARS AFTER BRADY BEGAN RUMBLING DOWNFIELD!\n\nBrady grasping at his knee,  the packers are your world champions of the now defunct NFL\n\n\n\n\n\n","comment_score":68}
{"sentiment_score":0,"magnitude":0.1,"text":"Plus, it'd be a rematch of superbowl 31, 20 years later.\n\nAlso, about a few more years of brady, I'm gonna bawl my fucking eyes out when he retires.","comment_score":11}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"Tom brady is exempt because he is why skill players go to new England and have their careers turned around.","comment_score":12}
{"sentiment_score":0,"magnitude":0.7,"text":"drew brees deserves all the recognition he receives, and more. dude is fucking legend, he just happened to play at the same time as a couple top 3 QBs ever when he's a mere easy top-10 guy. bit of a shame, but it's been a treat to watch manning, brady and brees the last ~15 years. ","comment_score":28}
{"sentiment_score":0.1,"magnitude":0.4,"text":"I don't think so. You don't beat brady in a shootout.\n","comment_score":30}
{"sentiment_score":0,"magnitude":1,"text":"Run where exactly? To the place where to broncos were plowing over the guards.  Or the right side? Where miller was running down a 5.89 brady? Where could he run?","comment_score":64}
{"sentiment_score":0.1,"magnitude":1.4,"text":"###[Tom Brady lofts up pass to Martellus Bennett for 2-yard TD](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_500k.mp4)\n\n^Play ^data: ^Q1 ^07:35, ^1st ^and ^2, ^ball ^on ^MIA ^2, ^C.Fleming ^reported ^in ^as ^eligible. ^T.Brady ^pass ^short ^right ^to ^M.Bennett ^for ^2 ^yards, ^TOUCHDOWN.","comment_score":18}
{"sentiment_score":0.1,"magnitude":0.3,"text":"One side-effect of Deflategate was that a number of Brady's personal emails were released, including a pretty funny exchange over a pool cover.\nhttp://www.sbnation.com/lookit/2015/8/6/9107891/tom-brady-do-not-buy-a-pool-in-new-england","comment_score":15}
{"sentiment_score":0,"magnitude":0,"text":"People were saying the same thing about brady after his first few chips, i have no doubt RW will continue to improve and if the hawks get him better weapons and an actual OL he could be scary good.","comment_score":11}
{"sentiment_score":-0.7,"magnitude":0.7,"text":"Yeah in the mid 2000s brady and half the team was listed as questionable every game.","comment_score":20}
{"sentiment_score":0,"magnitude":5.5,"text":"it's not an official diet. there have been a few articles about it you can google\n\nhttps://www.google.com/webhp?sourceid=chrome-instant&amp;ion=1&amp;espv=2&amp;ie=UTF-8#q=tom%20brady%20diet\n\ni first read it on New Years Day 2 years ago along with Mark Texeira's similar diet. and i do a combo of Tom Brady and http://dadamo.com/\n\nit's basically avoid sugar. i drink coffee and tea black with no sweetner. \n\navoid soda and junk food. like i said, my wife and I cook our food and take it to work with us. and wouldn't eat from the Whole Foods food bar on a regular basis. and no diet soda\n\neat real fresh cooked food. don't just heat up stuff you buy in a box\n\nget enough sleep. most nights i'm in bed by 10 or 10:30. i also try to avoid all electronics after 9:30 because i've found they wills screw up your sleep even if you go to bed early. most modern electronics give off high energy blue light in the 450nm range that affects your melatonin levels. the only exception i make is reading books on my ipad 2 but with the black screen on and the night light running so the letters are yellow. \n \nget excercise. i try to run 7 miles a week and do weights\n\nif you snack, do it healthy. late last year i added fruit and take those to work. mostly apples and pears\n\navoid white rice, white pasta. we buy brown and other hippie rices and brown rice pasta\n\ni haven't been to the doctor in a few years but my employer does voluntary health screenings and around a year ago my cholesterol was 189. my wife and I are early 40's and aren't taking any prescription drugs for anything. this stuff works if you take care of your body\n","comment_score":140}
{"sentiment_score":0.2,"magnitude":1.4,"text":"###[Tom Brady lobs a pass deep to Chris Hogan for 45 yards](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_hogan_45_yards_734588_500k.mp4)\n\n^Play ^data: ^Q2 ^07:37, ^3rd ^and ^10, ^ball ^on ^NE ^18, ^\\(Shotgun) ^T.Brady ^pass ^deep ^middle ^to ^C.Hogan ^to ^HOU ^37 ^for ^45 ^yards ^\\(C.Moore).","comment_score":18}
{"sentiment_score":0,"magnitude":0,"text":"brady's gonna bring the poison berries to midfield and demand that they both be named winners","comment_score":76}
{"sentiment_score":0,"magnitude":1.2,"text":"I swear back when the NFL was doing the breast cancer awareness campaign this season Brady mentioned a family member had cancer. \n\nI believe I heard it on one of the local news stations here in Boston. However, I can't find any news stories to confirm.\n\n**Edit** Someone posted a Tom Curran report about Brady's mom having health issues.\n\nhttps://www.reddit.com/r/nfl/comments/5rbcte/bradys_mother_illness_was_a_weight_for_him_to/","comment_score":79}
{"sentiment_score":-0.4,"magnitude":2.9,"text":"&gt;The only reason I watch patriot games now is to cheer the other team into causing a career ending injury on brady.\n\nI mean I guess I get not liking the guy, hating on success and all that.  But wishing injury on someone over a sport is just horrible and childish.  Shame on you.  It makes me very sad knowing that you might be a parent instilling these god awful values in your kids.","comment_score":19}
{"sentiment_score":-0.8,"magnitude":0.8,"text":"cut to barry sanders as a football, the camera zooms out to see him/the football being thrown to wide receiver in the end zone, and gets spiked, he then says this must be what tom brady mustve felt he juked out brian urlacher   ","comment_score":11}
{"sentiment_score":-0.1,"magnitude":1.1,"text":"I disagree. I think that bledsoe could have maintained at least as well as brady did those early years. People forget that Bledsoe was a top 10 qb at worst.","comment_score":13}
{"sentiment_score":0.2,"magnitude":0.7,"text":"Also, apparently, the greatest beer chugger.\n\nhttps://www.youtube.com/watch?v=N3zKiW_wAO8\n\nhttp://sports.nbcsports.com/2017/01/23/new-title-for-new-england-patriots-tom-brady-best-beer-chugger/","comment_score":11}
{"sentiment_score":-0.1,"magnitude":3.4,"text":"&gt; Dolphins getting worse\n\nJust made the playoffs for the first time, Tannehill looks legitimately like a franchise QB, young offensive and defensive players.\n\n&gt; brady nearing the end\n\nThe Patriots with Kraft as an owner are going to be like the Steelers I believe, always above average at worst.\n\n\n&gt; Easy decision.\n\nNY State Income Taxes vs. Florida State Income Taxes...","comment_score":12}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"half of brady's interceptions were thrown against seattle! ","comment_score":83}
{"sentiment_score":0.1,"magnitude":0.1,"text":"pls papa brady kill the birds","comment_score":20}
{"sentiment_score":-0.2,"magnitude":0.8,"text":"brady had 2 tipped ints and was under pressure the entire game and Lewis gave them free points with that kickoff fumble.  No team left in the playoffs is capable of applying that kind of pressure.  That Chiefs D is not at the same level.","comment_score":26}
{"sentiment_score":0.1,"magnitude":0.4,"text":"Don't hate, just appreciate. Him and brady are once in a generation, maybe even once in a lifetime qbs. I dont think anyone in the league currently will reach as high as either of them ","comment_score":14}
{"sentiment_score":-0.1,"magnitude":0.5,"text":"i don't see how that's possible for brady. manning threw 55 tds at 37 and was out of the league by 39. i get that injuries contributed to his noodle arm, but it seems like in sports age can catch up with you very suddenly and drastically. ","comment_score":15}
{"sentiment_score":-0.1,"magnitude":0.9,"text":"Same here, I don't hate brady, I respect anyone who does their job as well and for as long as he has.\n\nGoodell on the other hand? He deserves to be embarrassed.","comment_score":13}
{"sentiment_score":-0.3,"magnitude":0.7,"text":"I have no personal hatred for gb or aaron but if gb beats ne in the sb, the whole media network is going to talk about aaron rodgers for so long its going to be annoying as fuck. Not to mention bullshit opinions of tom brady being a system qb and that anyone can do what tom does under belichick is going to be stronger than ever.","comment_score":17}
{"sentiment_score":0,"magnitude":0,"text":"ESPN has been on the \"sink brady\" train since Mort tweeted about footballs. ","comment_score":18}
{"sentiment_score":0,"magnitude":1,"text":"welp thats what happens when you play zone against brady for the millionth fucking time....\n\neasily the best dynasty ever, jesus","comment_score":253}
{"sentiment_score":-0.1,"magnitude":0.7,"text":"The NFL has [stated](https://www.google.com/amp/www.cbssports.com/nfl/news/report-patriots-pay-a-brady-owned-company-run-by-suspect-partner/amp/?client=safari) that they're aware of the arrangement and have taken no action. So given the league's typical enthusiasm for disciplining the Pats this is probably a non-story. ","comment_score":200}
{"sentiment_score":-0.4,"magnitude":0.4,"text":"Until he calls the same play 20 times in a row with a slight variation and brady gets tired of that shit. ","comment_score":35}
{"sentiment_score":-0.4,"magnitude":0.8,"text":"yeah my point was about you saying how many comebacks brady and manning have. Those numbers don't mean anything and if someone just reads those numbers they wont have the full story ","comment_score":12}
{"sentiment_score":0,"magnitude":0,"text":"steelers vs falcons\nor\nbrady vs eli manning superbowl rd 3","comment_score":15}
{"sentiment_score":0,"magnitude":0.1,"text":"injuries and age. happens to every player in the league except brady","comment_score":11}
{"sentiment_score":0,"magnitude":0.2,"text":"tom brady needs a thumb ring.\n\ndont be selfish, gawd","comment_score":27}
{"sentiment_score":0.2,"magnitude":1,"text":"One of the emails which was released as a result of deflategate included Brady upset about a company not having a pool cover in white:\n\nhttp://www.businessinsider.com/tom-brady-pool-cover-emails-2015-8\n\nMinor thing obviously but it's funny so you'll see the jokes around.","comment_score":41}
{"sentiment_score":-0.1,"magnitude":0.1,"text":"the only reason brady did it is because his endorsements and wife make way more money than he could ever make in the nfl","comment_score":96}
{"sentiment_score":0.1,"magnitude":0.1,"text":"some qb would be lucky enough to get a sniff of the playoffs and here's brady just doing his routine sb appearances","comment_score":221}
{"sentiment_score":0.4,"magnitude":0.9,"text":"All time guy in bellicheck knows where to get defensive talent. Combine him with brady, perfect formula. ","comment_score":66}
{"sentiment_score":0.1,"magnitude":0.2,"text":"So brady wins a whole lot more than other all time great QBs when his team can't run the ball or he's in a come from behind/shootout.\n\nGotcha.","comment_score":13}
{"sentiment_score":0,"magnitude":1,"text":"Farve and elway if you ignore the consistency thing. I think they both had even better cannons, but more prone to mistakes. Its like you took 90% of farve and fused it with 90% of brady. I dont think hes as consistent as brady but hes got a ton more talent and hes obvious way more reliable than farve","comment_score":18}
{"sentiment_score":-0.2,"magnitude":0.8,"text":"Pass rush isn't important when he throws the ball in less than 2 seconds. You need good coverage to stop brady. Again, it would not be close.","comment_score":13}
{"sentiment_score":0.4,"magnitude":1.2,"text":"I believe [this](http://grantland.com/features/how-terminology-erhardt-perkins-system-helped-maintain-dominance-tom-brady-patriots/) is what you are thinking of, but that's the system the Pats use. It's running the same routes out of multiple formations.\n\nHere's the [relevant article on the Colts](http://grantland.com/features/how-return-simplicity-peyton-manning-indy-offense-ignited-denver-broncos/), which is pure simplicity - few plays, few formations, all execution.","comment_score":14}
{"sentiment_score":-0.4,"magnitude":0.8,"text":"No one thinks goodell hates brady. We just think that goodell bent to the will of the other owners of the league and went after brady/the patriots for a scandal that would have been a non story for any other team in the league, and dragged brady's name through the mud in the process. ","comment_score":448}
{"sentiment_score":0.1,"magnitude":1.4,"text":"###[Tom Brady lofts up pass to Martellus Bennett for 2-yard TD](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101brady_bennett_2_yard_td_718507_500k.mp4)\n\n^Play ^data: ^Q1 ^07:35, ^1st ^and ^2, ^ball ^on ^MIA ^2, ^C.Fleming ^reported ^in ^as ^eligible. ^T.Brady ^pass ^short ^right ^to ^M.Bennett ^for ^2 ^yards, ^TOUCHDOWN.","comment_score":18}
{"sentiment_score":0.6,"magnitude":0.6,"text":"pats fans are collectively just a proud momma looking out for our baby boy brady ","comment_score":60}
{"sentiment_score":0.4,"magnitude":0.4,"text":"i know im in the minority, and would obviously love brady for 15 more years... but it would be a relatively smooth transition to jimmy G seeing as we're on the fence about trading him or keeping him.","comment_score":44}
{"sentiment_score":0,"magnitude":0.8,"text":"###[Jadeveon Clowney lowers boom on Tom Brady, forces incompletion](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_clowney_hits_brady_734596_500k.mp4)\n\n^Play ^data: ^Q2 ^03:14, ^2nd ^and ^9, ^ball ^on ^NE ^34, ^\\(Shotgun) ^T.Brady ^pass ^incomplete ^short ^left ^to ^D.Lewis ^[J.Clowney].","comment_score":55}
{"sentiment_score":0,"magnitude":1.3,"text":"I feel like this isn't as much the case anymore. You have to get pressure with 4 while ALSO playing great man coverage, which is harder said than done. If you hit him a bunch of times, but your secondary isn't playing complimentary to that, brady will still do damage (especially in recent years where he doesn't see ghosts as much as he used to). It's teams like the texans and the broncos that have both strong secondaries *and* pass rushes that disrupted brady the most this season. Even the seahawks to an extent. ","comment_score":53}
{"sentiment_score":0.1,"magnitude":0.8,"text":"homie have you even watched football the last 10 years?\n\n&gt;[Throws](https://gfycat.com/OrderlyNegativeFluke)\n\n\n&gt;[short](http://stream1.gifsoup.com/view/1058496/brady-to-moss-65yd-td-o.gif)\n\n&gt;[relies](http://s3.amazonaws.com/br-cdn/temp_images/2013/11/03/2013-11-0314_26_39.gif)\n\n\n&gt;[on YAC](http://2.bp.blogspot.com/-rZmIWd806yY/UnbsnfpBh3I/AAAAAAAADQo/MRcZZQV_r8g/s1600/btoa.gif)\n\nlmao @ you\n\n","comment_score":17}
{"sentiment_score":0.3,"magnitude":1,"text":"eh kid is taken care of for life..think he's happy as well.\n\ntom went out of his way to make sure of that and him and Bridget and Giselle are bffs.\n\nfucking tom brady sitting when he pees but at least he's a man about it. ","comment_score":35}
{"sentiment_score":0.2,"magnitude":0.9,"text":"rodgers is the GOAT.\n\nunreal. MVP doesn't even describe what he has done for the packers this year. I trully believe this is a 2-14 team with anyone else QBing there maybe besides brady.","comment_score":11}
{"sentiment_score":0.4,"magnitude":1.8,"text":"in 10 years,  stafford will still be younger than brady is NOW, let alone 2 more years.\n\nstafford has been the fastest to 10k yards, 15k yards, 20k yards, etc.   That probably continues.  As long as he stays healthy.","comment_score":52}
{"sentiment_score":0.2,"magnitude":0.5,"text":"I don't really have a problem with this logic, but in that case tom brady should have absolutely been the MVP last year. The way he responded to a lack of receivers, running game, and O line protection was unprecedented, and I don't think another quarterback will ever have as much success in such unfavorable circumstances.","comment_score":24}
{"sentiment_score":0,"magnitude":1.1,"text":"the amount of people taking the steelers all week was hilarious. the amount of puffing of aaron rodger's ive listened to and his \"run the table\" nonsense when brady was straight up the better QB in his 12 starts...... how brady and the boys somehow flew under the radar the past couple weeks is beyond me.\n\nback in the bowl. keep doubting. ","comment_score":131}
{"sentiment_score":-0.1,"magnitude":0.9,"text":"http://www.sbnation.com/2014/1/9/5276868/breaking-madden-tom-brady\n\n&gt;I made 21 identical copies of Tom Brady, complete with his height, weight, and exact skill ratings in every category. Then I released every member of the Patriots' offense not named Tom Brady, and replaced them with Tom Brady. He'll be throwing to himself, handing off to himself, and blocking for himself.\n\n","comment_score":28}
{"sentiment_score":0.3,"magnitude":0.3,"text":"Yeah, but you'd have tom brady as qb","comment_score":15}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"you're getting downvoted because you're trying to sneak ride brady's nuts for taking less than market value for his services.","comment_score":27}
{"sentiment_score":0,"magnitude":0,"text":"The strongest case against brady is he only played 3/4 of a season.","comment_score":12}
{"sentiment_score":-0.5,"magnitude":1,"text":"I dunno, multiple turnovers and multiple hits on brady is pretty damn hard to do.  Their deep D isn't great, but it's nothing to scoff at.","comment_score":11}
{"sentiment_score":0,"magnitude":0,"text":"Looks better in this one from the 2014 AFCCG\nhttps://www.google.com/amp/www.sbnation.com/platform/amp/lookit/2015/1/18/7790827/tom-brady-juke-patriots-colts-afc-championship","comment_score":16}
{"sentiment_score":0,"magnitude":0,"text":"Suspend brady for the next 4 games, you say? ","comment_score":265}
{"sentiment_score":0.1,"magnitude":0.1,"text":"So tom brady would be better if he lost 2 more afc championship games?","comment_score":23}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"we win every turnover battle because brady's throws like 0 ints.","comment_score":16}
{"sentiment_score":-0.6,"magnitude":0.6,"text":"Don't let brady start game one of the 2008 season","comment_score":60}
{"sentiment_score":0.2,"magnitude":0.2,"text":"Jokes on you, they bought free brady shirts","comment_score":12}
{"sentiment_score":-0.2,"magnitude":3.1,"text":"Except phone records were granted to the investigators.\n\n\"As for what was on the phone, Brady says that they turned over \"detailed pages\" of phone records and all of the emails requested by the Wells investigators. They also went to the phone company to retrieve the relevant messages from his broken phone. The NFL acknowledged that last part in the 20-page statement explaining Goodell's decision, buried in a footnote on page 12.\n\nThe league declined to work with the phone company to retrieve the details of Brady's cell phone records because it was \"simply not practical.\" That line and Goodell's effort to make it sound like Brady's phone was deliberately destroyed prior to meeting with investigators doesn't instill much confidence in the the NFL's ad hoc approach to disciplining players.\"\n\n[Source](https://www.google.com/url?sa=t&amp;source=web&amp;rct=j&amp;url=/amp/www.sbnation.com/platform/amp/2015/7/29/9066253/tom-brady-cell-phone-deflategate-suspension-nfl-roger-goodell&amp;ved=0ahUKEwiH5MvAsurRAhXMlFQKHUrYBDcQFghWMAw&amp;usg=AFQjCNErDLFyeS7SGZ0H4EhmJ75RXQieag&amp;sig2=EkXDvoIcXWOUXhOf92-mxA)    ","comment_score":24}
{"sentiment_score":0.2,"magnitude":1.8,"text":"that's true but a good quarterback can elevate those around them, especially at the skill positions.\n\nlook at Manning or Brady and their receivers/tight ends/runningbacks after they left Manning or brady.\n\nStats are an imperfect way to compare QBs, but its the best way we have","comment_score":15}
{"sentiment_score":-0.1,"magnitude":2.4,"text":"Peyton had what, 7 straight seasons of 12 wins or more, most in league history.  Brady is at the same level.  Peyton has the most touchdowns, passing yards..etc, with brady right on his heals.  No two teams have been as dominant since peyton and brady have been in the league, period.  I am not saying it is a goat argument, i am saying that reaching the level of production of these two teams and these two qbs is an astronomical reach, for anyone.  There are a lot of young good qbs in the league, but to say they will reach this level is ludicrous.","comment_score":11}
{"sentiment_score":-0.1,"magnitude":2.6,"text":"[NFL Fines Von Miller For Illegal Tom Brady Hit But Just Half Regular Amount](http://nesn.com/2015/12/von-miller-fined-for-illegal-tom-brady-hit-but-only-half-regular-amount/)\n\n[Talib not fined for snatching Crabtree’s chain](http://profootballtalk.nbcsports.com/2017/01/06/talib-not-fined-for-snatching-crabtrees-chain/)\n\n[NFL rebukes Al Jazeera: ‘No credible evidence’ Peyton Manning used HGH](http://www.washingtontimes.com/news/2016/jul/25/nfl-rebukes-al-jazeera-peyton-manning-hgh-report/)\n\n[Broncos' Aqib Talib threatens Titans' Harry Douglas](http://www.delawareonline.com/videos/sports/nfl/2016/12/12/broncos'-aqib-talib-threatens-titans'-harry-douglas/95338124/)\n\n[NFL rescinds T.J. Ward's $9,115 fine for slamming Julian Edelman](http://broncoswire.usatoday.com/2017/01/18/denver-broncos-news-nfl-lifts-t-j-ward-fine-julian-edelman-hit/)\n\nThese are just events within the past year I can recall off the top of my head. I can't imagine why he feels Denver gets special treatment.","comment_score":12}
{"sentiment_score":-0.4,"magnitude":1.9,"text":"\"Boutta fukkin wreck you in the sb kid\"\n\n\"Deflate my fuckin balls brady\"\n\n\"wut? cant hear u over the artificial crowd noise\"","comment_score":17}
{"sentiment_score":-0.1,"magnitude":0.2,"text":"Ben isn't really comprable to brady and peyton imo. There are way more young Ben's in the league than there are Brady/Peytons ","comment_score":43}
{"sentiment_score":-0.4,"magnitude":1.8,"text":"Not really. And that's insanely misleading. You have to count the bonus for goodness sake. Why didn't you just say tom brady, 2016, he only made $1 million!!! ","comment_score":25}
{"sentiment_score":-0.1,"magnitude":0.8,"text":"You can say that about most players, really. Guys with a tom brady playoff sample size arent tremendously common\n\nThats why im not a huge fan of using playoff stats to make a for or against for a player...the sample size often isn't there to indicate an obvious trend ","comment_score":148}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"tom brady is fucking crazy","comment_score":11}
{"sentiment_score":0,"magnitude":0.6,"text":"lets hope that by the time you have a child \nA) tom brady isn't retired\nB) bill bilichick isn't dead.\n\nsince you are a redditor,  it looks grimm. you are better off moving to a city like oakland. derek carr is still young!","comment_score":209}
{"sentiment_score":-0.3,"magnitude":0.6,"text":"The first play when they were still in the end zone, brady baited them into encroachment, therefore getting out of the end zone, can't be mad at Seattle for BBs plan going right. When brady knelt, and they knew he would knelt, they lashed out like the children they are despite having no chance of winning.","comment_score":35}
{"sentiment_score":0.1,"magnitude":3.8,"text":"Vance has done wonders with our dbs. They were the unit of the team that terrified me most. Last week all 4 backups were starters versus brady. He's made a project wr look ok at cb whose been our #2 most of the year. He's helped a lot back there. McCain, one of the worst cbs in the entire league played the entire game and didn't give up 200 yards.\n\nThere wasn't much in the back 7 to begin with this year, and after injuries, there wasn't shit.","comment_score":11}
{"sentiment_score":0,"magnitude":0,"text":"People were saying the same thing about brady after his first few chips, i have no doubt RW will continue to improve and if the hawks get him better weapons and an actual OL he could be scary good.","comment_score":11}
{"sentiment_score":0.1,"magnitude":0.2,"text":"Yeah, if I was more interested I would do wins/games played for all 4 of them (plus manning, so 5), but that feels like a lot of work and I'm feeling pretty lazy. \n\nsuspensions and injuries def suppressed a few of their numbers, but i'll bet wins/games played puts brady at #1 and manning at #2","comment_score":16}
{"sentiment_score":0,"magnitude":3,"text":"Headcoach, injuries, talent around you. Gb doesn't really pick up players outside of the draft. Take your pick?\n\nMaybe brady or manning have slightly better decision making but it's not that much better than rodgers. Rodgers has em both athletically and the accuracy...so many of his throws are just perfect. I'm not saying brady or manning are shit compared to him. Just no question to me that he's the best QB I'll likely ever watch play.","comment_score":14}
{"sentiment_score":0,"magnitude":1.2,"text":"###[Whitney Mercilus uses slick spin move to sack Tom Brady](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_500k.mp4)\n\n^Play ^data: ^Q2 ^06:06, ^3rd ^and ^6, ^ball ^on ^HOU ^33, ^\\(Shotgun) ^T.Brady ^sacked ^at ^HOU ^37 ^for ^-4 ^yards ^\\(W.Mercilus).","comment_score":16}
{"sentiment_score":0,"magnitude":0.3,"text":"Its pretty crazy how many great QBs this passing era has produced, when I think about it Ryan wouldn't even have been in my top 5 a year or two ago cause he has to play in a league that had Peyton, brady, Brees, Rodgers, and Big Ben. 2013 was a off year for him to (26-17 td int)","comment_score":13}
{"sentiment_score":-0.1,"magnitude":0.9,"text":"Alright, so if you take out the part where we went to 4 superbowls, and won 3 of them. And went 14-3 in the playoffs, we end up with the Patriots STILL going to more superbowls, and having a 9-6 record. So I guess if you only look at bradys least successful time, it's only slightly better than rodgers","comment_score":12}
{"sentiment_score":0.4,"magnitude":0.9,"text":"All time guy in bellicheck knows where to get defensive talent. Combine him with brady, perfect formula. ","comment_score":66}
{"sentiment_score":0,"magnitude":1.6,"text":"I hope they did. It was really bad. \n\nUrlacher should have made that play, that juke was better than you would've expected from brady but really...\n\nI think he just wanted to get a hit on the qb like most defensive players do and overcommitted to getting a little bit of hurt on Brady instead of slowing down and wrapping up","comment_score":15}
{"sentiment_score":0,"magnitude":1,"text":"welp thats what happens when you play zone against brady for the millionth fucking time....\n\neasily the best dynasty ever, jesus","comment_score":253}
{"sentiment_score":-0.4,"magnitude":1.9,"text":"\"Boutta fukkin wreck you in the sb kid\"\n\n\"Deflate my fuckin balls brady\"\n\n\"wut? cant hear u over the artificial crowd noise\"","comment_score":17}
{"sentiment_score":0.3,"magnitude":0.7,"text":"I dont want people to say \"oh you only beat the patriots because tom brady accidentally went on a murderous rampage and went to jail for life\". I want the victory to be complete.","comment_score":76}
{"sentiment_score":0,"magnitude":0,"text":"[You're goddamn right](http://www.totalprosports.com/wp-content/uploads/2013/12/16-tom-brady-stupid-hair.jpg)","comment_score":38}
{"sentiment_score":0.5,"magnitude":0.5,"text":"everyone knows brady's great, it's okay dude","comment_score":11}
{"sentiment_score":0.4,"magnitude":0.4,"text":"&gt;Rodgers has way more talent, brady has the better ~~resume~~ career","comment_score":15}
{"sentiment_score":0.1,"magnitude":2.8,"text":"**Falcons** over Seahawks. I think the seahawks have been too inconsistent this year and Falcons have so many ways of beating you. If earl thomas was healthy, this would have been a tougher choice.\n\n**Steelers** over chiefs. Steelers are on fire right now and the chiefs defense has looked vulnerable against some of the more elite offenses. I think teh steelers defense is playing at a level good enough to shut down alex smith. \n\n**Cowboys** over Packers. I think the cowboys will have a lot of sucess running the ball, and will play their game of eating away at the clock, giving the ball to aaron rodgers as little as possible. If the packers slow down the running game even a little, then i think they can pull it out, but i don't expect that. \n\n**Patriots** over the Texans. A healthy Patriots team at home against a team they demolished earlier in the season. If you can believe it, our defense is actually playing better now than it was against teh texans in the shutout. Even if the texans manage to slow down brady, we have so many weapons on offense that the pats will still put up points. ","comment_score":17}
{"sentiment_score":0.2,"magnitude":0.9,"text":"rodgers is the GOAT.\n\nunreal. MVP doesn't even describe what he has done for the packers this year. I trully believe this is a 2-14 team with anyone else QBing there maybe besides brady.","comment_score":11}
{"sentiment_score":0.2,"magnitude":1.8,"text":"You only hate his dad *now*?\n\nhttp://www.espn.com/blog/nflnation/post/_/id/53216/tom-brady-takes-shot-at-buffalo\n\n&gt;\"Even when I started my pro career, he traveled to Buffalo,\" Brady said of his father. \"I don't know if you guys have ever been to the hotels in Buffalo — they're not the nicest places in the world — but he would still travel to those [games]. It was just great to grow up in a house like that and feel so supported by your mom and dad.\"","comment_score":49}
{"sentiment_score":0.1,"magnitude":1.1,"text":"###[Tom Brady throws laser to Julian Edelman for first down](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/REG/17/170101bradyedelman20_718504_500k.mp4)\n\n^Play ^data: ^Q1 ^11:47, ^3rd ^and ^3, ^ball ^on ^NE ^42, ^\\(Shotgun) ^T.Brady ^pass ^short ^middle ^to ^J.Edelman ^to ^MIA ^38 ^for ^20 ^yards ^\\(S.Paysinger).","comment_score":20}
{"sentiment_score":0.2,"magnitude":0.2,"text":"A lot of Bills fans say he needs too much work and we need a better \"franchise QB\",Like we have a clone of 30 year old Tom brady in the back office ready to be trotted out. ","comment_score":13}
{"sentiment_score":0.2,"magnitude":0.4,"text":"Peyton all the way.\n\nBrady is [wooden](http://www.nbc.com/saturday-night-live/video/tom-brady-monologue/n11951?snl=1), and [Peyton](https://www.youtube.com/watch?v=cSuHQZjzJYY) has natural [screen presence.](https://www.youtube.com/watch?v=YGmX6m78zDM)\n\n","comment_score":33}
{"sentiment_score":-0.4,"magnitude":3.5,"text":"\"We are aware of the arrangement and have not determined that there is any violation of the CBA\" - NFL\n\nThe NFLPA says that it \"has no implication on the salary cap.\"\n\nhttps://www.bostonglobe.com/sports/2015/12/19/patriots-pay-business-owned-tom-brady-and-partner-with-dubious-past/C4zMzcPDgU62WMMg10qeBL/story.html\n\nHonestly, I agree that this is a bigger deal that deflated balls (even if I thought anything happened, which I don't).  Having a quack providing medical services opens the league up to potential lawsuits.  David Chao was bad enough, and he was legally licensed to practice medicine.  This guy is just a kook.","comment_score":49}
{"sentiment_score":0,"magnitude":1.2,"text":"###[Whitney Mercilus uses slick spin move to sack Tom Brady](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_hou_mercilus_sacks_brady_734594_500k.mp4)\n\n^Play ^data: ^Q2 ^06:06, ^3rd ^and ^6, ^ball ^on ^HOU ^33, ^\\(Shotgun) ^T.Brady ^sacked ^at ^HOU ^37 ^for ^-4 ^yards ^\\(W.Mercilus).","comment_score":16}
{"sentiment_score":0.1,"magnitude":0.4,"text":"I don't think so. You don't beat brady in a shootout.\n","comment_score":30}
{"sentiment_score":0.1,"magnitude":1.4,"text":"###[Tom Brady flips a screen pass to Dion Lewis for a 13-yard TD](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_500k.mp4)\n\n^Play ^data: ^Q1 ^09:34, ^1st ^and ^10, ^ball ^on ^HOU ^13, ^T.Brady ^pass ^short ^left ^to ^D.Lewis ^for ^13 ^yards, ^TOUCHDOWN. ^NE-M.Bennett ^was ^injured ^during ^the ^play.","comment_score":30}
{"sentiment_score":0,"magnitude":1,"text":"&gt;Plus he only won 11 games, the same amount as Brady but Brady did it in 4 fewer games\n\nlol it's so funny to me how Pats fans try to spin brady's suspension as a positive thing. Let's put that another way: Brady, with a far superior team around him, won the same number of games playing a much easier schedule and while putting up worse stats than Ryan. He doesn't have an argument ","comment_score":61}
{"sentiment_score":0.2,"magnitude":0.8,"text":"Peyton and Brady also have had the most successful records, playoff appearances, stats, superbowls(brady), superbowl appearances in league history.  Every single thing about brady and manning scream best in league history, production and league dominance included.  It is a long shot for anyone to reach the dominance of those two.","comment_score":18}
{"sentiment_score":0.5,"magnitude":3,"text":"I read a webMD (I know, odd) article about Brady's diet, and the nutritionist they talked to said, yes, Brady is going overboard for the no nightshade vegetables and stuff like that, but he isn't doing anything to harm his body and that the diet is overall really good for him.\n\nThe thing I'm most impressed with was actually his sleep schedule. What grown man, let alone one with disposable income goes to bed as early as Brady? His sole focus is to continue to play as long as he possibly can, its quite remarkable. \n\nEdit: Found the article [here](http://www.webmd.com/diet/news/20160115/tom-brady-gisele-bundchen-diet#1)","comment_score":13}
{"sentiment_score":0.7,"magnitude":0.7,"text":"it also involves tom brady. say what you want, but his name alone brings out all the haters in the world, as well as the staunch homers. ","comment_score":64}
{"sentiment_score":0,"magnitude":9.9,"text":"&gt; Ryan imo is a lot like Belichick if he never got Tom Brady. \n\nI disagree. The biggest thing is that Belichick doesn't try to force square pegs into a round hole. He builds his team around what he has.\n\nOn defense and offense.\n\nRunning team, then big play team, then two TE team, now it's a bunch of short passes and keeping posession. \n\nDefense went from 3-4, to 4-3. \n\n&gt;he gets hired by the Bills who had a top defence but none of the pieces to fit a Ryan defence so he's going to take a while to get there.\n\nRight, a top defense...and what doe she do? Does he adjust his defensive philosophy to use guys like williamsn dareus, etc? Nope. He takes 4-3 guys and tries to make them work in an overly complicated 3-4...because that's his \"thing.\" \n\nGo look at the patriots defensive roster from like 2001-2009, then from like 2010 onward. As belichick lost 3-4 guys like ty warren, vince wilfork, and richard seymour, and tried to replace them with guys like kyle love, and ron brace (unsuccessfully) he began to transition toward 4-3 guys. He starts drafting guys like chander jones, dominic easley, malcolm brown. He signs guy like ninkovich, long, sheard, etc. \n\n&gt;But how is that any different than Belichick?\n\n11-5 without brady in 2008, and 3-1 without brady in 2016. Small sample sizes? Yes, but neither team looked like trash. \n\nYes, if you give rex ryan a shutdown CB in revis in his prime, a solid #2 in cromartie in his prime, and a bunch of good 3-4 players, he can be good. He went 11-5 in 2010. It's not like he ever went 13-3 or 14-2. \n\nYes, if you give him ed reed, ray lewis, and tarrel suggs (in their primes) hecan come up with a great defense. Lots of guys could. \n\nAs a HC? He's not unlucky. He's mediocre at best. \n\nIt's one thing to talk about marty schotenheimer going 14-2 and and being fired. \n\nIt's another to pretend that a medicore HC is some sort of genius who just had some back luck. \n\n\n\n","comment_score":73}
{"sentiment_score":0.3,"magnitude":0.3,"text":"Exactly, he said brady doesn't wish for his attractiveness","comment_score":17}
{"sentiment_score":0.1,"magnitude":0.1,"text":"So tom brady would be better if he lost 2 more afc championship games?","comment_score":23}
{"sentiment_score":0.5,"magnitude":0.5,"text":"brady's also deep enough in his career to care more about winning games than $$$","comment_score":63}
{"sentiment_score":-0.1,"magnitude":1.6,"text":"This has been all but confirmed.  \n\nBoth [ESPN](http://www.espn.com/espn/otl/story/_/id/13533995/split-nfl-new-england-patriots-apart) and [SI](http://www.si.com/nfl/2015/09/08/patriots-cheating-suspicions-bill-belichick-tom-brady?xid=si_social) ran stories around the same time with multiple sources stating that the owners were angry that the Patriots were not punished more for SpyGate, and demanded harsh treatment on the ball deflation bullshit.  This certainly jibes with the fact that Troy Vincent said that [the whole matter would be wrapped up in a few days](https://www.bostonglobe.com/sports/2015/01/20/vincent/38YWpilDkAJXiQVqXReDuK/story.html), and it [ended up lasting longer](http://www.espn.com/nfl/story/_/id/15857262/nfl-500-days-later-deflategate-full-mystery-tom-brady-new-england-patriots) than [Joseph Gordon-Levitt's relationship with Summer](http://www.imdb.com/title/tt1022603/?ref_=nv_sr_1).  \n\nThere was also [a Bleacher Report article](http://bleacherreport.com/articles/2629481-the-patriots-are-not-on-the-clock-deflategate-fallout-looms-large-in-nfl-draft) where they polled team execs shortly after DeflateGate and they were all happy about the investigation, then polled them a year later and they all regretted it because they were suddenly worried about their own team being subjected to the whims of the league office's discipline.","comment_score":56}
{"sentiment_score":0.2,"magnitude":3.8,"text":"Ok, I'm the biggest Patriots homer there is.  But this needs to be said, please upvote this comment so it gets visibility.\n\nIn 2013, TB12 (Tom Brady's fitness and wellness company) [opened the TB12 Center](https://www.bostonglobe.com/sports/2015/12/19/patriots-pay-business-owned-tom-brady-and-partner-with-dubious-past/C4zMzcPDgU62WMMg10qeBL/story.html) at Patriot Place (a large shopping center owned by the Kraft's directly outside of Gilette stadium).  It specializes in physical therapy and treating athletes of all kinds, **including active Patriots players**, and developing fitness and wellness routines for them.\n\nIn fact, TB12 is paid, **by the Patriots**, to provide treatment and nutritional supplements for the team and its players.  Because this is a private business deal, the amount the Patriots are paying TB12 is undisclosed and unknown.  It could be simple market rates of $200/hr for massages and wellness counseling as is indicated in the Globe article, but for all we know the Patriots could be paying TB12 a $10,000,000 retainer each year for its services.\n\nThe whole situation is just crazy to me.  I mean, it makes sense in that Brady has been trying to grow his brand for over a decade and may have now in fact found it in his high performance late in age which TB12's services now align perfect with, but still, this arrangement is remarkable.  I can't think of another situation where there was a private business deal between a professional sports team and its star player.","comment_score":21}
{"sentiment_score":0,"magnitude":3,"text":"You have guys with ability playing hard for a good coach who sets them up for success.\n\nSaying they wouldn't make a roster is a bit much.  Yeah some of them were fringe guys, but that's because other coaches didn't know how to use their talents.  \n\nHogan can run the same routes for any other QB.  75% of the QBs can hit someone like him when he gets open.\n\nEdelman and Brady just have amazing chemistry, but without brady Edelman would still be a great special teamer if he didn't break into the receiving corps for someone else.\n\nThe patriots aren't magic, they just know how to use a guy's full potential. \n\nI don't know where I was going with that but F keyshawn and his dumb ass","comment_score":23}
{"sentiment_score":-0.2,"magnitude":0.5,"text":"We areone of the more disliked teamd though.  Good bye first round pick and sorry about brady's upcoming suspension","comment_score":15}
{"sentiment_score":-0.1,"magnitude":0.7,"text":"Brady tends to get the ball out quickly because that's the offense new england runs due to their personnel at wide reciever. It wasn't always like this. Also sure brady doesn't need a lot of support but if he gets one he breaks records and goes 16-0.","comment_score":71}
{"sentiment_score":0,"magnitude":7.9,"text":"\"And brady breaks out of the pocket! He's at the 30!\n\n*... 25 seconds later*\n\nHe's at the 45 about to cross into green bay territory!\n\n*... 30 minutes pass by*\n\nOh my goodness brian urlacher has just ran onto the field out of the stands to exact his vengeance. [Oh my the elusive agile jungle cat Tom Brady has somehow evaded the great Urlacher](http://giant.gfycat.com/AcrobaticIckyGibbon.gif) It appears as though urlachers knees have exploded in the process may he RIP.\n\n*... It is now week 3 in the preseason for other teams in the NFL, they must continue despite no resolution to the super bowl yet*\n\nAND Brady is now separating himself, barreling downfield like the flow out of a tipped over syrup bottle!\n\n*21 years later, the Vikings just finished trading 2/3 of their state's territory for herschel walker III in the seasons running parallel to this yet to be resolved super bowl*\n\nAND Brady is at the 30! If he can score the patriots will win the- *at this moment joe buck dies of old age*\n\n*15 years later, the lions win their once every fifty years playoff game in the newly formed UXZFL^2 , the Minnesota Vikings get caught in an embarrassing intergalactic spaceship alien hooker sex party scandal*\n\nAND Brady is at the 10! COULD. HE. GO. ALL. THE. WAY. \n\nWait there is one man in pursuit! The newly acquired number 49! He won't make it in time he'll have to dive and go for the legs! OH AND #49 BERNARD POLLARD HAS STOPPED BRADY AT THE ONE YARD LINE NEARLY 40 YEARS AFTER BRADY BEGAN RUMBLING DOWNFIELD!\n\nBrady grasping at his knee,  the packers are your world champions of the now defunct NFL\n\n\n\n\n\n","comment_score":68}
{"sentiment_score":0.3,"magnitude":1,"text":"eh kid is taken care of for life..think he's happy as well.\n\ntom went out of his way to make sure of that and him and Bridget and Giselle are bffs.\n\nfucking tom brady sitting when he pees but at least he's a man about it. ","comment_score":35}
{"sentiment_score":0.2,"magnitude":0.2,"text":"I prefer a scenario where we question who is better, johnny or brady.","comment_score":45}
{"sentiment_score":0,"magnitude":5.5,"text":"it's not an official diet. there have been a few articles about it you can google\n\nhttps://www.google.com/webhp?sourceid=chrome-instant&amp;ion=1&amp;espv=2&amp;ie=UTF-8#q=tom%20brady%20diet\n\ni first read it on New Years Day 2 years ago along with Mark Texeira's similar diet. and i do a combo of Tom Brady and http://dadamo.com/\n\nit's basically avoid sugar. i drink coffee and tea black with no sweetner. \n\navoid soda and junk food. like i said, my wife and I cook our food and take it to work with us. and wouldn't eat from the Whole Foods food bar on a regular basis. and no diet soda\n\neat real fresh cooked food. don't just heat up stuff you buy in a box\n\nget enough sleep. most nights i'm in bed by 10 or 10:30. i also try to avoid all electronics after 9:30 because i've found they wills screw up your sleep even if you go to bed early. most modern electronics give off high energy blue light in the 450nm range that affects your melatonin levels. the only exception i make is reading books on my ipad 2 but with the black screen on and the night light running so the letters are yellow. \n \nget excercise. i try to run 7 miles a week and do weights\n\nif you snack, do it healthy. late last year i added fruit and take those to work. mostly apples and pears\n\navoid white rice, white pasta. we buy brown and other hippie rices and brown rice pasta\n\ni haven't been to the doctor in a few years but my employer does voluntary health screenings and around a year ago my cholesterol was 189. my wife and I are early 40's and aren't taking any prescription drugs for anything. this stuff works if you take care of your body\n","comment_score":140}
{"sentiment_score":0,"magnitude":0.2,"text":"about time big ben and brady got another playoff game. Despite both teams being dominate there has only been one game between them in the postseason.","comment_score":181}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"Uhhhh brady gets shit for it every game thread","comment_score":12}
{"sentiment_score":0,"magnitude":1,"text":"&gt;Plus he only won 11 games, the same amount as Brady but Brady did it in 4 fewer games\n\nlol it's so funny to me how Pats fans try to spin brady's suspension as a positive thing. Let's put that another way: Brady, with a far superior team around him, won the same number of games playing a much easier schedule and while putting up worse stats than Ryan. He doesn't have an argument ","comment_score":61}
{"sentiment_score":0,"magnitude":3.1,"text":"Anyone who uses a 4 rings &gt;2 argument as a sole basis of arguing for brady or montana over manning is an idiot. That said, I think that looking post-season success is more than valid, considering that's the entire reason they play the game. 100% sure Manning and Brady would trade their 2013 and 2007 records for  winning the super bowl that year. Obviously no single post-season can be singled out, but I think that winning several SB, and consistently performing in the playoffs, is indicative that you got the job done, which is perhaps the most important thing you want for a qb. \n\nAlso, with regards to the other players, those sports also had a period of their league where there simply was no parity for several reasons (few teams, no salary cap etc.) There were only 8 teams in the league when Bill Russell won 11. Henri Richard won his 11 when there were only 6 teams in the league. No one argues that those guys are the GOAT because the league they played in is not comparable to the league that MJ or Gretzky played in. No one argues that Otto Graham is the GOAT either, despite the fact that he has 7 championships. He just played in such a different era that it's futile to make any comparisons.\n\nAlso Gretzky was just so far ahead of everyone else in terms of productivity. If Manning had stats that were so far ahead of everyone else (like double the number of TDs for example), then no one would argue who the GOAT was.\n\n ","comment_score":40}
{"sentiment_score":0.1,"magnitude":2.8,"text":"**Falcons** over Seahawks. I think the seahawks have been too inconsistent this year and Falcons have so many ways of beating you. If earl thomas was healthy, this would have been a tougher choice.\n\n**Steelers** over chiefs. Steelers are on fire right now and the chiefs defense has looked vulnerable against some of the more elite offenses. I think teh steelers defense is playing at a level good enough to shut down alex smith. \n\n**Cowboys** over Packers. I think the cowboys will have a lot of sucess running the ball, and will play their game of eating away at the clock, giving the ball to aaron rodgers as little as possible. If the packers slow down the running game even a little, then i think they can pull it out, but i don't expect that. \n\n**Patriots** over the Texans. A healthy Patriots team at home against a team they demolished earlier in the season. If you can believe it, our defense is actually playing better now than it was against teh texans in the shutout. Even if the texans manage to slow down brady, we have so many weapons on offense that the pats will still put up points. ","comment_score":17}
{"sentiment_score":0.1,"magnitude":1.5,"text":"A big name means nothing if he doesn't produce more.\n\n\nhttps://www.reddit.com/r/nfl/comments/43lbgk/manningbrady_the_supporting_casts_a_statistical/\n\n&gt;Manning average: 14.5 Stdev: 7.5\n\n&gt;Brady average: 10.3 Stdev: 6.9\n\n&gt;Overall, Brady has had the better end of the deal in terms of rushing attacks. This one takes the opposite trend from Defense - whereas Manning had better rushers early on, Brady has had better rushers since 2007.\n\n&gt;Brady also had only three below-average rushing attacks, whereas Manning has had to deal with 7.\n\nAnd Brady's OL was better, so there is that. ","comment_score":27}
{"sentiment_score":0.2,"magnitude":1,"text":"One of the emails which was released as a result of deflategate included Brady upset about a company not having a pool cover in white:\n\nhttp://www.businessinsider.com/tom-brady-pool-cover-emails-2015-8\n\nMinor thing obviously but it's funny so you'll see the jokes around.","comment_score":41}
{"sentiment_score":-0.1,"magnitude":0.7,"text":"Brady tends to get the ball out quickly because that's the offense new england runs due to their personnel at wide reciever. It wasn't always like this. Also sure brady doesn't need a lot of support but if he gets one he breaks records and goes 16-0.","comment_score":71}
{"sentiment_score":-0.1,"magnitude":5.2,"text":"In 2002 Brady signed a 4 year, 30m extension that made him one of the highest paid QBs in the league.\n\nIn 2005 Brady signed a 6 year deal through 2010 that made him one of the highest paid *players* in the league. Throughout that contract they played in 2 AFCCG, 1 Super Bowl, and he missed 1 season.\n\nIn 2010, he signed a contract that made him **the** highest paid player in the league. On *that* contract they played in 2 AFCCGs and 1 Super Bowl.\n\nIn 2012 he effectively took a \"paycut\" in terms of cap hit, but didn't lose money. [Seriously](http://patscap.com/brady.html), with his \"discount\" from 2012 on, he averaged $16.4m in *cash* that he received every single year. Are we saying that that's a discount? His cap hit is, but that's financial \"wizardry\" not being cheap. He's getting in cash around what most QBs are getting - Ryan will get around $17-18m in *cash* this year, but his contract means he has an additional $5m in signing bonus - he got that when he signed the contract.\n\n\nThis whole \"Brady is a team player thing\" is absurd - they went undefeated when he was one of the highest paid players. They had the 2010 amazing season when he was the highest paid player. They played in 2 Super Bowls after his big contracts.\n\nBut nope, his contract is the MVP.\n\n\nEDIT: To add on to this, his contract he signed meant that if he got cut in 2016, he'd have $26m in dead money. If he gets cut next year, it's still $13m. That means that if he sucked they are hurting bad with money. The team gambled on a 39 year old quarterback staying healthy and not falling off a cliff.","comment_score":266}
{"sentiment_score":0.2,"magnitude":0.8,"text":"Peyton and Brady also have had the most successful records, playoff appearances, stats, superbowls(brady), superbowl appearances in league history.  Every single thing about brady and manning scream best in league history, production and league dominance included.  It is a long shot for anyone to reach the dominance of those two.","comment_score":18}
{"sentiment_score":-0.2,"magnitude":0.8,"text":"The refs ruled that brady was down with the ball, Jesus christ people, learn the rules. Yes, the D stole the fucking ball in the pile from brady, doesn't make a difference. ","comment_score":19}
{"sentiment_score":0.1,"magnitude":0.8,"text":"nah not really\n\nwe have the best record against the brady patriots ","comment_score":12}
{"sentiment_score":-0.1,"magnitude":0.8,"text":"brady, manning, montana, young, elway, brees, unitas, graham marino, farve, stabauch.\n\nedit: MISTAKE MISTAKE MISTAKE MONTANNA IS DEF TOP 10\n","comment_score":11}
{"sentiment_score":-0.8,"magnitude":0.8,"text":"I don't trust the media to cover it, too many in the media still say brady cheated even though the evidence and the nfl's report says the opposite.","comment_score":12}
{"sentiment_score":0.2,"magnitude":11.3,"text":"1 [Nink sacks Brock](https://gfycat.com/OrangeSlimyGander)\n\n2 [Logan Ryan breaks up a pass on 3rd down](https://gfycat.com/NeighboringTenderDanishswedishfarmdog)\n\n3 [AJ Bouye’s face lol](https://gfycat.com/WarmHotDrafthorse)\n\n4 [Brady to Hogan 22yd](https://gfycat.com/CarefreeAngelicAllosaurus)\n\n5 [Lewis TD](https://gfycat.com/FlickeringPleasingAntarcticgiantpetrel)\n\n6 [Butler tackles Fuller](https://gfycat.com/WillingShorttermKinkajou)\n\n7 [Ryan sacks Oz](https://gfycat.com/FancyNewAxisdeer)\n\n8 [Lewis 98 yard return TD](https://gfycat.com/FarawayLonelyArmadillo)\n\n9 [Ryan breakup on Hopkins](https://gfycat.com/NauticalComplicatedFrilledlizard)\n\n10 [Brady to Hogan 45yd](https://gfycat.com/UntidyInsistentAmericanrobin)\n\n11 [Stellar punt by Allen](https://gfycat.com/UnknownValuableCrustacean)\n\n12 [Nice block by Nink on 3rd down](https://gfycat.com/ClutteredHorribleCondor)\n\n13 [Brady to Edelman 45yd](https://gfycat.com/AbsoluteLeanAidi)\n\n14 [Brady rushes to the 1](https://gfycat.com/PerkyBasicAkitainu)\n\n15 [Brady snot rocket, because I know someone will ask](https://gfycat.com/EducatedArtisticAfricanharrierhawk)\n\n16 [Van Noy gets to Osweiler](https://gfycat.com/LiquidCostlyCutworm)\n\n17 [Brady to Edelman 20yd](https://gfycat.com/BelovedHospitableBarracuda)\n\n18 [Brady to Hogan 21yd](https://gfycat.com/GrayPoshAsianpiedstarling)\n\n19 [Lewis tumbles into a 1st down](https://gfycat.com/JadedSlipperyHarpseal)\n\n20 [Brady to White TD](https://gfycat.com/EverySoulfulCommabutterfly)\n\n21 [McCourty Interception](https://gfycat.com/WelltodoBowedGraywolf)\n\n22 [Brady to Edelman for a 1st down](https://gfycat.com/QuestionableFemaleHyracotherium)\n\n23 [Slater downs this punt at the 2](https://gfycat.com/NastyEntireCondor)\n\n24 [Roberts with a big hit](https://gfycat.com/RashVariableElver)\n\n25 [Shea McClellin incomplete pass thing](https://gfycat.com/PerfectThornyGavial)\n\n26 [Floyd picks up a 1st](https://gfycat.com/VapidTanHogget)\n\n27 [Lewis picks up a 1st](https://gfycat.com/SilverFragrantDogwoodclubgall)\n\n28 [Ryan int](https://gfycat.com/RequiredDelayedGrebe)\n\n29 [Lewis TD 2](https://gfycat.com/NearBitesizedGosling)\n\n30 [Brown sacks Oz](https://gfycat.com/FaintWellgroomedJunco)\n\n31 [End around Edelman for 13](https://gfycat.com/GleefulHonoredHerculesbeetle)\n\n32 [Amendola end around](https://gfycat.com/PlasticHardtofindEyra)\n\n33 [Bill said some words](https://gfycat.com/BitesizedSatisfiedFlatcoatretriever)\n\n34 [Harmon Interception](https://gfycat.com/ZanyDelectableGilamonster)\n\n35 [Brock is vexed](https://gfycat.com/RealInferiorCranefly)\n\n36 [Blount rushes for 16](https://gfycat.com/MagnificentDeliciousKrill)\n\n[Fedorawitch picks up 17](https://gfycat.com/ShyDrearyAlaskankleekai)\n\n[McKinney interception](https://gfycat.com/ClosedBasicConure)\n\n[Mercilus flattens Lewis](https://gfycat.com/LawfulPartialBluewhale)\n\n[clowney hits brady](https://gfycat.com/FamiliarVigorousDassie)\n\n[Mercilus sacks Brady](https://gfycat.com/UnfitDismalBluet)\n\n[Cushing sacks Brady](https://gfycat.com/MellowPersonalGossamerwingedbutterfly)\n\n[Fedorawitch TD](https://gfycat.com/EqualAcrobaticAustraliankestrel)\n\n[Pleasant fumble recovery](https://gfycat.com/DecimalCraftyKookaburra)\n\n[Bouye Interception](https://gfycat.com/ObedientDimLangur)\n\n","comment_score":647}
{"sentiment_score":-0.3,"magnitude":0.8,"text":"Just wait. The day will come when brady and BB are no longer there and your entire fanbase will shrink, people will brag about a era that no longer exists and the entire NFL world will feel no sympathy.","comment_score":44}
{"sentiment_score":0.3,"magnitude":2.5,"text":"###[Tom Brady fits perfect pass to James White for 19-yard TD](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_white_19_yard_td_734619_500k.mp4)\n\n^Play ^data: ^Q3 ^09:14, ^3rd ^and ^3, ^ball ^on ^HOU ^19, ^\\(Shotgun) ^T.Brady ^pass ^deep ^right ^to ^J.White ^for ^19 ^yards, ^TOUCHDOWN. ^NE ^12-Brady ^18th ^career ^postseason ^game ^with ^2 ^pass ^TD, ^extends ^his ^NFL ^record ^\\(Favre, ^15).","comment_score":26}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"tom brady is fucking crazy","comment_score":11}
{"sentiment_score":0.2,"magnitude":0.2,"text":"3-1 without brady","comment_score":16}
{"sentiment_score":0,"magnitude":8.9,"text":"Brady also went out partying with Gisele before Superbowl 42. He was seen wearing a walking boot earlier in the day, but had it off when he was out with Gisele. I'm just glad this happened before social media became a huge fixture in our lives because the amount of scrutiny Brady would have got would have sent Pats fans over the edge. [Source](http://archive.boston.com/sports/football/patriots/articles/2008/01/21/brady_spotted_in_what_appears_to_be_walking_boot/?rss_id=Boston.com+--+Patriots+news)\n\n\n\nThis Odell story is getting so much attention for a whole bunch of reasons, deserved or not: \n\n1. Odell's been a vortex of drama this season and the media's got a lot of views by promoting him. fighting the kicking net, tantrums on the sideline, proposing to the kicking net, and now this boat business. Add to this stories of him banging his head against a wall in the locker room after the playoff loss. \n\n2. It's the New York Giants. They get a lot of spotlight by virtue of being a New York team. The Jets may have been a dumpster fire of epic proportions this season but since they've been eliminated, all the attention's on the Giants. This was also the best playoff game of Wildcard Weekend, scheduled in the best slot. \n\n3. Odell and the receivers played horribly in Green Bay. This after the boat picture and warming up without any shirts. When you ask for that much attention from the world, you've got to perform. \n\nThis whole thing is fucking stupid. I personally don't think going to Miami was a big deal. A giants fan on this forum also wrote that Odell's been flying out after games all season to go to LA. I can't verify whether that's true or not, but if it is it's clear that Odell and co. just had a bad game. \n\nGoing forward Odell just needs to be more low key with his partying. Dude's a major celebrity and he's only 24. Everyone wants to hang out with this guy and party with him. There's no doubt he wants to stunt on the world a bit, hence the post on social media. But the scrutiny isn't worth it. He's an emotional guy and to have to hear about the boat over and over again after the loss must have driven him crazy. Especially since he lead the offence into the post-season in the first place. People should remember what a force he was this season, instead everyone's gonna remember him flopping against the Packers.  \n\n\n\n","comment_score":679}
{"sentiment_score":-0.4,"magnitude":3.5,"text":"\"We are aware of the arrangement and have not determined that there is any violation of the CBA\" - NFL\n\nThe NFLPA says that it \"has no implication on the salary cap.\"\n\nhttps://www.bostonglobe.com/sports/2015/12/19/patriots-pay-business-owned-tom-brady-and-partner-with-dubious-past/C4zMzcPDgU62WMMg10qeBL/story.html\n\nHonestly, I agree that this is a bigger deal that deflated balls (even if I thought anything happened, which I don't).  Having a quack providing medical services opens the league up to potential lawsuits.  David Chao was bad enough, and he was legally licensed to practice medicine.  This guy is just a kook.","comment_score":49}
{"sentiment_score":0.2,"magnitude":3.8,"text":"Ok, I'm the biggest Patriots homer there is.  But this needs to be said, please upvote this comment so it gets visibility.\n\nIn 2013, TB12 (Tom Brady's fitness and wellness company) [opened the TB12 Center](https://www.bostonglobe.com/sports/2015/12/19/patriots-pay-business-owned-tom-brady-and-partner-with-dubious-past/C4zMzcPDgU62WMMg10qeBL/story.html) at Patriot Place (a large shopping center owned by the Kraft's directly outside of Gilette stadium).  It specializes in physical therapy and treating athletes of all kinds, **including active Patriots players**, and developing fitness and wellness routines for them.\n\nIn fact, TB12 is paid, **by the Patriots**, to provide treatment and nutritional supplements for the team and its players.  Because this is a private business deal, the amount the Patriots are paying TB12 is undisclosed and unknown.  It could be simple market rates of $200/hr for massages and wellness counseling as is indicated in the Globe article, but for all we know the Patriots could be paying TB12 a $10,000,000 retainer each year for its services.\n\nThe whole situation is just crazy to me.  I mean, it makes sense in that Brady has been trying to grow his brand for over a decade and may have now in fact found it in his high performance late in age which TB12's services now align perfect with, but still, this arrangement is remarkable.  I can't think of another situation where there was a private business deal between a professional sports team and its star player.","comment_score":21}
{"sentiment_score":0,"magnitude":0.1,"text":"injuries and age. happens to every player in the league except brady","comment_score":11}
{"sentiment_score":0.1,"magnitude":1.4,"text":"###[Tom Brady flips a screen pass to Dion Lewis for a 13-yard TD](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_lewis_13_yard_td_734557_500k.mp4)\n\n^Play ^data: ^Q1 ^09:34, ^1st ^and ^10, ^ball ^on ^HOU ^13, ^T.Brady ^pass ^short ^left ^to ^D.Lewis ^for ^13 ^yards, ^TOUCHDOWN. ^NE-M.Bennett ^was ^injured ^during ^the ^play.","comment_score":30}
{"sentiment_score":-0.1,"magnitude":2.4,"text":"Peyton had what, 7 straight seasons of 12 wins or more, most in league history.  Brady is at the same level.  Peyton has the most touchdowns, passing yards..etc, with brady right on his heals.  No two teams have been as dominant since peyton and brady have been in the league, period.  I am not saying it is a goat argument, i am saying that reaching the level of production of these two teams and these two qbs is an astronomical reach, for anyone.  There are a lot of young good qbs in the league, but to say they will reach this level is ludicrous.","comment_score":11}
{"sentiment_score":0,"magnitude":0,"text":"The strongest case against brady is he only played 3/4 of a season.","comment_score":12}
{"sentiment_score":-0.2,"magnitude":1.9,"text":"they also realize that playing behind elite OL make life easier on you and when you're not the best of the best with an elite OL, how much worse you'll get if your OL is ever bad is a big 'what if'\n\nyou get hit more, rushed more and guys are less open for you, it forces you to move faster, think faster and be more precise. a .3 second mistake can be the difference in a TD and a sack\n\nit's easier to judge guys behind shitty OL than it is when they never get dirty\n\ngive winston, luck and wilson better OL and their mistakes probably come down, wilson and luck would be right there with brady and winston would be better off than he is now as the 3rd most hit QB in the NFL\n\nhell throw matt ryan in there too, he gets hit a lot and his OL isn't great\n\nbut if dak and mariota got hit 8 times per game like wilson, winston and luck, mariota probably wouldn't make it 8 games and dak throws more picks. i think dak would be better than mariota in that case because mariota led QBs in fumbles last year in only 12 games and was #1 in turnovers per game","comment_score":13}
{"sentiment_score":0.1,"magnitude":3.8,"text":"Vance has done wonders with our dbs. They were the unit of the team that terrified me most. Last week all 4 backups were starters versus brady. He's made a project wr look ok at cb whose been our #2 most of the year. He's helped a lot back there. McCain, one of the worst cbs in the entire league played the entire game and didn't give up 200 yards.\n\nThere wasn't much in the back 7 to begin with this year, and after injuries, there wasn't shit.","comment_score":11}
{"sentiment_score":0,"magnitude":8.9,"text":"Brady also went out partying with Gisele before Superbowl 42. He was seen wearing a walking boot earlier in the day, but had it off when he was out with Gisele. I'm just glad this happened before social media became a huge fixture in our lives because the amount of scrutiny Brady would have got would have sent Pats fans over the edge. [Source](http://archive.boston.com/sports/football/patriots/articles/2008/01/21/brady_spotted_in_what_appears_to_be_walking_boot/?rss_id=Boston.com+--+Patriots+news)\n\n\n\nThis Odell story is getting so much attention for a whole bunch of reasons, deserved or not: \n\n1. Odell's been a vortex of drama this season and the media's got a lot of views by promoting him. fighting the kicking net, tantrums on the sideline, proposing to the kicking net, and now this boat business. Add to this stories of him banging his head against a wall in the locker room after the playoff loss. \n\n2. It's the New York Giants. They get a lot of spotlight by virtue of being a New York team. The Jets may have been a dumpster fire of epic proportions this season but since they've been eliminated, all the attention's on the Giants. This was also the best playoff game of Wildcard Weekend, scheduled in the best slot. \n\n3. Odell and the receivers played horribly in Green Bay. This after the boat picture and warming up without any shirts. When you ask for that much attention from the world, you've got to perform. \n\nThis whole thing is fucking stupid. I personally don't think going to Miami was a big deal. A giants fan on this forum also wrote that Odell's been flying out after games all season to go to LA. I can't verify whether that's true or not, but if it is it's clear that Odell and co. just had a bad game. \n\nGoing forward Odell just needs to be more low key with his partying. Dude's a major celebrity and he's only 24. Everyone wants to hang out with this guy and party with him. There's no doubt he wants to stunt on the world a bit, hence the post on social media. But the scrutiny isn't worth it. He's an emotional guy and to have to hear about the boat over and over again after the loss must have driven him crazy. Especially since he lead the offence into the post-season in the first place. People should remember what a force he was this season, instead everyone's gonna remember him flopping against the Packers.  \n\n\n\n","comment_score":679}
{"sentiment_score":0.1,"magnitude":0.1,"text":"brady missed the first 4 games lmao","comment_score":15}
{"sentiment_score":0.2,"magnitude":1.9,"text":"###[Tom Brady connects with Julian Edelman for 48 yards](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_500k.mp4)\n\n^Play ^data: ^Q2 ^03:08, ^3rd ^and ^9, ^ball ^on ^NE ^34, ^\\(Shotgun) ^T.Brady ^pass ^deep ^left ^to ^J.Edelman ^to ^HOU ^18 ^for ^48 ^yards ^\\(A.Hal; ^K.Jackson). ^NE ^11-Edelman ^70th ^career ^postseason ^reception, ^new ^franchise ^record ^and ^tied ^for ^9th ^all-time ^\\(Biletnikoff ^&amp; ^Boldin).","comment_score":37}
{"sentiment_score":0.4,"magnitude":0.4,"text":"There's this gem from the Deflategate trials: http://media.gq.com/photos/55cd027124ace34a31312e4b/master/pass/brady-sketch-01.jpg","comment_score":11}
{"sentiment_score":0,"magnitude":5,"text":"In retrospect (and some of us were saying it at the time), Brady's '13 and early '14 struggles had a lot to do with a depleted set of weapons (though I think those issues were starting to get to Brady and affecting his play. He was throwing his passes *way* too hard and low for awhile because he just had so little trust in his receiving corps).\n\nBut there was definitely a lot of reason to think that *part* of the problem was a Brady decline. The Pats were lining things up to make it easier to move on from Brady in the near future (a course they later reversed), and when the Pats stomped the Bengals the game after Kansas City, [Gronk said:](http://www.patriots.com/video/2014/10/05/press-pass-rob-gronkowski) \n\n&gt;*\"I told my brother before we came to the game... 'I'm gonna make 12 look like Tom Brady again, baby.' And I went out there, with my teammates, and we made Tom Brady look like Tom Brady* after you guys were criticizing him all week. The fans, everything. And it feels so good, and he's such a leader, and he went over 50,000 yards today, he's an unbelievable player and I'm so glad to play with him.\n\nWatching the video there's definitely a bit of an impression that Gronk viewed Brady as a lion in winter (albeit later in the interview he called Brady a \"young buck\" and said \"he's got a lot in his tank left.\"). There's an implication that making Brady look like Brady was an accomplishment by the receiving corps and the OL, rather than a function of them snapping out of a funk and *letting* Brady look like Brady again.\n\nAll of which is to say, while the media *definitely* overreacted after the KC loss and was ignoring huge and obvious extenuating factors, there was some reason to wonder. I think [this Summer 2014 article](http://www.espn.com/nfl/insider/story/_/id/11020311/tom-brady-no-longer-top-5-qb-nfl) by one of PFF's more notable writers arguing that Brady was no longer a top 5 QB was flat out wrong even at the time, but you can understand why the discussion was going on, and it certainly looked, at the surface level, like Brady would at least *soon* no longer be a top 5 QB.\n","comment_score":18}
{"sentiment_score":0.1,"magnitude":0.1,"text":"Playing soft zone against the pats possession WR's and brady is asking you lose. ","comment_score":154}
{"sentiment_score":0.7,"magnitude":0.7,"text":"A stat like this for brady, bress and manning would be nice to have","comment_score":17}
{"sentiment_score":0,"magnitude":5,"text":"In retrospect (and some of us were saying it at the time), Brady's '13 and early '14 struggles had a lot to do with a depleted set of weapons (though I think those issues were starting to get to Brady and affecting his play. He was throwing his passes *way* too hard and low for awhile because he just had so little trust in his receiving corps).\n\nBut there was definitely a lot of reason to think that *part* of the problem was a Brady decline. The Pats were lining things up to make it easier to move on from Brady in the near future (a course they later reversed), and when the Pats stomped the Bengals the game after Kansas City, [Gronk said:](http://www.patriots.com/video/2014/10/05/press-pass-rob-gronkowski) \n\n&gt;*\"I told my brother before we came to the game... 'I'm gonna make 12 look like Tom Brady again, baby.' And I went out there, with my teammates, and we made Tom Brady look like Tom Brady* after you guys were criticizing him all week. The fans, everything. And it feels so good, and he's such a leader, and he went over 50,000 yards today, he's an unbelievable player and I'm so glad to play with him.\n\nWatching the video there's definitely a bit of an impression that Gronk viewed Brady as a lion in winter (albeit later in the interview he called Brady a \"young buck\" and said \"he's got a lot in his tank left.\"). There's an implication that making Brady look like Brady was an accomplishment by the receiving corps and the OL, rather than a function of them snapping out of a funk and *letting* Brady look like Brady again.\n\nAll of which is to say, while the media *definitely* overreacted after the KC loss and was ignoring huge and obvious extenuating factors, there was some reason to wonder. I think [this Summer 2014 article](http://www.espn.com/nfl/insider/story/_/id/11020311/tom-brady-no-longer-top-5-qb-nfl) by one of PFF's more notable writers arguing that Brady was no longer a top 5 QB was flat out wrong even at the time, but you can understand why the discussion was going on, and it certainly looked, at the surface level, like Brady would at least *soon* no longer be a top 5 QB.\n","comment_score":18}
{"sentiment_score":-0.2,"magnitude":0.2,"text":"How many of thisw fifty are drom brady and bill? ","comment_score":75}
{"sentiment_score":0,"magnitude":1.5,"text":"&gt; Increases injury frequency, sets Tom bradys injury and toughness low. Proceeds to hit stick him until injured. Quit game after injury, busts a nut, and reload.\n\nFTFY","comment_score":16}
{"sentiment_score":0.2,"magnitude":11.3,"text":"1 [Nink sacks Brock](https://gfycat.com/OrangeSlimyGander)\n\n2 [Logan Ryan breaks up a pass on 3rd down](https://gfycat.com/NeighboringTenderDanishswedishfarmdog)\n\n3 [AJ Bouye’s face lol](https://gfycat.com/WarmHotDrafthorse)\n\n4 [Brady to Hogan 22yd](https://gfycat.com/CarefreeAngelicAllosaurus)\n\n5 [Lewis TD](https://gfycat.com/FlickeringPleasingAntarcticgiantpetrel)\n\n6 [Butler tackles Fuller](https://gfycat.com/WillingShorttermKinkajou)\n\n7 [Ryan sacks Oz](https://gfycat.com/FancyNewAxisdeer)\n\n8 [Lewis 98 yard return TD](https://gfycat.com/FarawayLonelyArmadillo)\n\n9 [Ryan breakup on Hopkins](https://gfycat.com/NauticalComplicatedFrilledlizard)\n\n10 [Brady to Hogan 45yd](https://gfycat.com/UntidyInsistentAmericanrobin)\n\n11 [Stellar punt by Allen](https://gfycat.com/UnknownValuableCrustacean)\n\n12 [Nice block by Nink on 3rd down](https://gfycat.com/ClutteredHorribleCondor)\n\n13 [Brady to Edelman 45yd](https://gfycat.com/AbsoluteLeanAidi)\n\n14 [Brady rushes to the 1](https://gfycat.com/PerkyBasicAkitainu)\n\n15 [Brady snot rocket, because I know someone will ask](https://gfycat.com/EducatedArtisticAfricanharrierhawk)\n\n16 [Van Noy gets to Osweiler](https://gfycat.com/LiquidCostlyCutworm)\n\n17 [Brady to Edelman 20yd](https://gfycat.com/BelovedHospitableBarracuda)\n\n18 [Brady to Hogan 21yd](https://gfycat.com/GrayPoshAsianpiedstarling)\n\n19 [Lewis tumbles into a 1st down](https://gfycat.com/JadedSlipperyHarpseal)\n\n20 [Brady to White TD](https://gfycat.com/EverySoulfulCommabutterfly)\n\n21 [McCourty Interception](https://gfycat.com/WelltodoBowedGraywolf)\n\n22 [Brady to Edelman for a 1st down](https://gfycat.com/QuestionableFemaleHyracotherium)\n\n23 [Slater downs this punt at the 2](https://gfycat.com/NastyEntireCondor)\n\n24 [Roberts with a big hit](https://gfycat.com/RashVariableElver)\n\n25 [Shea McClellin incomplete pass thing](https://gfycat.com/PerfectThornyGavial)\n\n26 [Floyd picks up a 1st](https://gfycat.com/VapidTanHogget)\n\n27 [Lewis picks up a 1st](https://gfycat.com/SilverFragrantDogwoodclubgall)\n\n28 [Ryan int](https://gfycat.com/RequiredDelayedGrebe)\n\n29 [Lewis TD 2](https://gfycat.com/NearBitesizedGosling)\n\n30 [Brown sacks Oz](https://gfycat.com/FaintWellgroomedJunco)\n\n31 [End around Edelman for 13](https://gfycat.com/GleefulHonoredHerculesbeetle)\n\n32 [Amendola end around](https://gfycat.com/PlasticHardtofindEyra)\n\n33 [Bill said some words](https://gfycat.com/BitesizedSatisfiedFlatcoatretriever)\n\n34 [Harmon Interception](https://gfycat.com/ZanyDelectableGilamonster)\n\n35 [Brock is vexed](https://gfycat.com/RealInferiorCranefly)\n\n36 [Blount rushes for 16](https://gfycat.com/MagnificentDeliciousKrill)\n\n[Fedorawitch picks up 17](https://gfycat.com/ShyDrearyAlaskankleekai)\n\n[McKinney interception](https://gfycat.com/ClosedBasicConure)\n\n[Mercilus flattens Lewis](https://gfycat.com/LawfulPartialBluewhale)\n\n[clowney hits brady](https://gfycat.com/FamiliarVigorousDassie)\n\n[Mercilus sacks Brady](https://gfycat.com/UnfitDismalBluet)\n\n[Cushing sacks Brady](https://gfycat.com/MellowPersonalGossamerwingedbutterfly)\n\n[Fedorawitch TD](https://gfycat.com/EqualAcrobaticAustraliankestrel)\n\n[Pleasant fumble recovery](https://gfycat.com/DecimalCraftyKookaburra)\n\n[Bouye Interception](https://gfycat.com/ObedientDimLangur)\n\n","comment_score":647}
{"sentiment_score":0.4,"magnitude":0.9,"text":"Not only that but he is kind of the anti-brady in that Brady is meticulous about everything he puts in his body.\n\nEli would have no issue with a steak topped with ice cream.","comment_score":216}
{"sentiment_score":0.1,"magnitude":0.1,"text":"Joe out played brady twice in a row in afc championship games but it's a fluke five years straight making the playoffs and always winning a game but it's a fluke ����","comment_score":59}
{"sentiment_score":-0.1,"magnitude":2.1,"text":"Terry Bradshaw 4-0\n\nDan Marino Lost 0-1\n\nJim Kelly Lost 0-4\n\nSteve McNair Lost 0-1\n\n[full list from 2015](http://www.syracuse.com/superbowl/index.ssf/2015/01/list_quarterback_most_super_bowl_wins_2015_tom_brady_montana_bradshaw.html)\n\nI don't see correlation. \n\nEdit: Had list from 2005, it was from 2015","comment_score":52}
{"sentiment_score":0,"magnitude":9.9,"text":"&gt; Ryan imo is a lot like Belichick if he never got Tom Brady. \n\nI disagree. The biggest thing is that Belichick doesn't try to force square pegs into a round hole. He builds his team around what he has.\n\nOn defense and offense.\n\nRunning team, then big play team, then two TE team, now it's a bunch of short passes and keeping posession. \n\nDefense went from 3-4, to 4-3. \n\n&gt;he gets hired by the Bills who had a top defence but none of the pieces to fit a Ryan defence so he's going to take a while to get there.\n\nRight, a top defense...and what doe she do? Does he adjust his defensive philosophy to use guys like williamsn dareus, etc? Nope. He takes 4-3 guys and tries to make them work in an overly complicated 3-4...because that's his \"thing.\" \n\nGo look at the patriots defensive roster from like 2001-2009, then from like 2010 onward. As belichick lost 3-4 guys like ty warren, vince wilfork, and richard seymour, and tried to replace them with guys like kyle love, and ron brace (unsuccessfully) he began to transition toward 4-3 guys. He starts drafting guys like chander jones, dominic easley, malcolm brown. He signs guy like ninkovich, long, sheard, etc. \n\n&gt;But how is that any different than Belichick?\n\n11-5 without brady in 2008, and 3-1 without brady in 2016. Small sample sizes? Yes, but neither team looked like trash. \n\nYes, if you give rex ryan a shutdown CB in revis in his prime, a solid #2 in cromartie in his prime, and a bunch of good 3-4 players, he can be good. He went 11-5 in 2010. It's not like he ever went 13-3 or 14-2. \n\nYes, if you give him ed reed, ray lewis, and tarrel suggs (in their primes) hecan come up with a great defense. Lots of guys could. \n\nAs a HC? He's not unlucky. He's mediocre at best. \n\nIt's one thing to talk about marty schotenheimer going 14-2 and and being fired. \n\nIt's another to pretend that a medicore HC is some sort of genius who just had some back luck. \n\n\n\n","comment_score":73}
{"sentiment_score":0.2,"magnitude":0.6,"text":"I'm 32 and I was born in Foxboro, I have followed them my whole life.  I had a pen-pal in green bay when I was in 6th grade for the 96 superbowl, and I cried when they lost. I misspoke, I meant all of the brady-era Patriots superbowls.  ","comment_score":11}
{"sentiment_score":-0.1,"magnitude":5.2,"text":"In 2002 Brady signed a 4 year, 30m extension that made him one of the highest paid QBs in the league.\n\nIn 2005 Brady signed a 6 year deal through 2010 that made him one of the highest paid *players* in the league. Throughout that contract they played in 2 AFCCG, 1 Super Bowl, and he missed 1 season.\n\nIn 2010, he signed a contract that made him **the** highest paid player in the league. On *that* contract they played in 2 AFCCGs and 1 Super Bowl.\n\nIn 2012 he effectively took a \"paycut\" in terms of cap hit, but didn't lose money. [Seriously](http://patscap.com/brady.html), with his \"discount\" from 2012 on, he averaged $16.4m in *cash* that he received every single year. Are we saying that that's a discount? His cap hit is, but that's financial \"wizardry\" not being cheap. He's getting in cash around what most QBs are getting - Ryan will get around $17-18m in *cash* this year, but his contract means he has an additional $5m in signing bonus - he got that when he signed the contract.\n\n\nThis whole \"Brady is a team player thing\" is absurd - they went undefeated when he was one of the highest paid players. They had the 2010 amazing season when he was the highest paid player. They played in 2 Super Bowls after his big contracts.\n\nBut nope, his contract is the MVP.\n\n\nEDIT: To add on to this, his contract he signed meant that if he got cut in 2016, he'd have $26m in dead money. If he gets cut next year, it's still $13m. That means that if he sucked they are hurting bad with money. The team gambled on a 39 year old quarterback staying healthy and not falling off a cliff.","comment_score":266}
{"sentiment_score":0.4,"magnitude":0.4,"text":"Mechabrady is never leaving us though ","comment_score":23}
{"sentiment_score":0.1,"magnitude":1.5,"text":"*please dont look at my post history*\n\nBut seriously I think a lot of pats fans are happy for matty ice since BC is the only real big time college football program that New England has. I think the \"my GOAT\" talk is mostly in jest, but also fans being pissed off at the league in general for the 4 game suspension. I think you will see a lot of people refocus on the real goal: To get a 5th ring for brady","comment_score":24}
{"sentiment_score":0.2,"magnitude":0.2,"text":"Jokes on you, they bought free brady shirts","comment_score":12}
{"sentiment_score":0,"magnitude":0.7,"text":"what about brady in 2016 only vs. rodgers all time? \n\nthis **proves** brady is better than rodgers\n\n14:1 &gt; 4:1","comment_score":13}
{"sentiment_score":0.6,"magnitude":1.2,"text":"Been a fan of Matt [since he crushed my bears in 2008](https://www.youtube.com/watch?v=MmJRVcFrDmE)\n\nHope they don't give into the brady pressure and let Matt get an MVP he's well deserving of.","comment_score":95}
{"sentiment_score":0.7,"magnitude":0.7,"text":"its works great against brady...do it all the time","comment_score":13}
{"sentiment_score":0,"magnitude":0,"text":"I will delete my Reddit account if brady wins 11 Super Bowls","comment_score":32}
{"sentiment_score":0.1,"magnitude":0.1,"text":"http://www.cbssports.com/nfl/news/tom-brady-reveals-his-favorite-recipe-from-his-200-cookbook/\n\n","comment_score":20}
{"sentiment_score":0.2,"magnitude":0.2,"text":"There were punters drafted before tom brady! ","comment_score":27}
{"sentiment_score":0.3,"magnitude":0.3,"text":"[Oh yeah](http://www.foxsports.com/nfl/story/new-england-patriots-tom-brady-emails-deflategate-080515)","comment_score":11}
{"sentiment_score":0.2,"magnitude":1.9,"text":"###[Tom Brady connects with Julian Edelman for 48 yards](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_5000k.mp4)\n\n#####Lower bitrates: [3200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_3200k.mp4) | [2000k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_2000k.mp4) | [1200k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_1200k.mp4) | [700k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_700k.mp4) | [500k](http://video.nfl.com/films/2016/NFL_COM/in-game-highlight/NFLCOM/POST/2/170114_bp_ne_brady_edelman_48_yards_734599_500k.mp4)\n\n^Play ^data: ^Q2 ^03:08, ^3rd ^and ^9, ^ball ^on ^NE ^34, ^\\(Shotgun) ^T.Brady ^pass ^deep ^left ^to ^J.Edelman ^to ^HOU ^18 ^for ^48 ^yards ^\\(A.Hal; ^K.Jackson). ^NE ^11-Edelman ^70th ^career ^postseason ^reception, ^new ^franchise ^record ^and ^tied ^for ^9th ^all-time ^\\(Biletnikoff ^&amp; ^Boldin).","comment_score":37}
{"sentiment_score":0,"magnitude":0,"text":"Lol you all fucking wish brady was bitching in your team's uniform","comment_score":21}
{"sentiment_score":-0.6,"magnitude":0.6,"text":"Don't let brady start game one of the 2008 season","comment_score":60}
{"sentiment_score":0.1,"magnitude":0.8,"text":"nah not really\n\nwe have the best record against the brady patriots ","comment_score":12}
{"sentiment_score":0.1,"magnitude":0.1,"text":"Joe out played brady twice in a row in afc championship games but it's a fluke five years straight making the playoffs and always winning a game but it's a fluke ����","comment_score":59}
{"sentiment_score":0.4,"magnitude":0.4,"text":"There's this gem from the Deflategate trials: http://media.gq.com/photos/55cd027124ace34a31312e4b/master/pass/brady-sketch-01.jpg","comment_score":11}
{"sentiment_score":-0.3,"magnitude":0.6,"text":"The patriots actually start slow in the super bowl more so than all the teams they have gone up against. They have 0 points in the first quarter in all of their SBs (with brady/BB)","comment_score":11}
{"sentiment_score":0.6,"magnitude":1.2,"text":"Been a fan of Matt [since he crushed my bears in 2008](https://www.youtube.com/watch?v=MmJRVcFrDmE)\n\nHope they don't give into the brady pressure and let Matt get an MVP he's well deserving of.","comment_score":95}
{"sentiment_score":0.6,"magnitude":0.6,"text":"but brady is a systems qb so itll work well","comment_score":21}
{"sentiment_score":-0.1,"magnitude":0.6,"text":"Most ridiculous part of that is that the offense scored enough points to win. The defense let brady do whatever he wanted and blew the game. The defense plays better, they dont need a last second TD","comment_score":14}
{"sentiment_score":0.3,"magnitude":0.7,"text":"I dont want people to say \"oh you only beat the patriots because tom brady accidentally went on a murderous rampage and went to jail for life\". I want the victory to be complete.","comment_score":76}
{"sentiment_score":0,"magnitude":0,"text":"Besides brady you havent produced a franchise qb","comment_score":11}
{"sentiment_score":0.2,"magnitude":0.2,"text":"[Here you go](https://www.reddit.com/r/nfl/comments/5fcnvd/belichick_on_bradys_historic_200th_win_hes_won_a/daj74wr)","comment_score":98}
{"sentiment_score":0.3,"magnitude":0.3,"text":"Exactly, he said brady doesn't wish for his attractiveness","comment_score":17}
{"sentiment_score":0.2,"magnitude":0.2,"text":"/r/falcons2 is gonna explode when brady or rodgers wins ","comment_score":23}
{"sentiment_score":0.3,"magnitude":0.3,"text":"[Oh yeah](http://www.foxsports.com/nfl/story/new-england-patriots-tom-brady-emails-deflategate-080515)","comment_score":11}
{"sentiment_score":0.1,"magnitude":0.1,"text":"[but Brady is better at goat pics](https://classic17.files.wordpress.com/2010/08/tom-brady-goat.jpg)","comment_score":154}
{"sentiment_score":0.7,"magnitude":0.7,"text":"A stat like this for brady, bress and manning would be nice to have","comment_score":17}
{"sentiment_score":0.8,"magnitude":0.8,"text":"Yeah Imma need Shaq Mason helping brady with the brace","comment_score":20}
{"sentiment_score":-0.3,"magnitude":0.3,"text":"did you know that this isnt brady's first superbowl?","comment_score":297}
{"sentiment_score":0,"magnitude":0,"text":"I will delete my Reddit account if brady wins 11 Super Bowls","comment_score":32}
{"sentiment_score":-0.6,"magnitude":0.6,"text":"God brady runs so awkwardly","comment_score":70}
{"sentiment_score":0.1,"magnitude":0.1,"text":"He won the same amount of games as brady this year","comment_score":31}
{"sentiment_score":0.2,"magnitude":0.2,"text":"[shhhhh.....](http://profootballtalk.nbcsports.com/2015/08/27/tom-brady-once-sponsored-a-concussion-prevention-drink-too/)","comment_score":22}
{"sentiment_score":0.4,"magnitude":0.8,"text":"damn i'm surprised brady gets emotional about making the superbowl for some reason. Prob bc as fans its a forgone conclusion he'll get there but it prob is amazing and huge for brady the player","comment_score":19}
{"sentiment_score":0,"magnitude":0,"text":"Lol you all fucking wish brady was bitching in your team's uniform","comment_score":21}
{"sentiment_score":0,"magnitude":0.2,"text":"cris collinsworth already said his vote went to brady.  so probably not","comment_score":343}
